package com.nakulbhoria.funnyhindijokes;


import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.DividerItemDecoration;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.facebook.ads.AdError;
import com.facebook.ads.NativeAdsManager;
import com.google.android.gms.ads.AdListener;
import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.InterstitialAd;

import java.util.ArrayList;

/**
 * A simple {@link Fragment} subclass.
 */
public class FatherSonJokesFragment extends Fragment implements NativeAdsManager.Listener {


    final ArrayList<Joke> jokes = new ArrayList<>();
    private NativeAdsManager mNativeAdsManager;
    private RecyclerView listView;

    public FatherSonJokesFragment() {
        // Required empty public constructor
    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        String placement_id = "1869998493118528_1870003033118074";
        mNativeAdsManager = new NativeAdsManager(getActivity(), placement_id, 0);
        mNativeAdsManager.loadAds();
        mNativeAdsManager.setListener(this);

        View rootView = inflater.inflate(R.layout.joke_list,container , false);
        listView = rootView.findViewById(R.id.list);
        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        jokes.add(new Joke("1. बेटा – मुझे शादी नहीं करनी!! मुझे सभी औरतों से डर लगता है!\n" +
                "पिता- कर ले बेटा! फिर एक ही औरत से डर लगेगा, बाकी सब अच्छी लगेंगी।"));
        jokes.add(new Joke("2. पिता बेटे पर गुस्सा करते हुए – एक काम ढंग से नहीं होता तुझसे , तुम्हें पुदीना लाने के लिए कहा था और तुम ये धनिया ले आए , तुझ जैसे बेवकूफ को तो घर से निकाल देना चाहिए \n" +
                "बेटा: पापा चलो इकठे ही चलते है\n" +
                "पिता : क्यों ?\n" +
                "बेटा: मम्मी कह रही थी कि ये मेथी है!!!!"));
        jokes.add(new Joke("3. पिता : फोन पर कौन था? \n" +
                "संजू : दोस्त था \n" +
                "पिता : वास्तव में बता कौन था? \n" +
                "संजू : संजय दत्त \n" +
                "संजू सुधर नहीं सकता और इसी तरह पिटता रहेगा!!!!"));
        jokes.add(new Joke("4. बेटा: पापा, आप परेशान क्यों हैं?\n" +
                "पापा : जिनके नसीब मेंसुख न लिखा हो ना बेटा, उनकी बीवी छुट्टियों में भी मायके नहीं जाती !!!"));
        jokes.add(new Joke("5. पापा और 15 साल का बेटा एक होटल में गए…\n" +
                "पापा- वेटर एक बियर और एक आईसक्रीम लाओ ,\n" +
                "बेटा – आईसक्रीम क्यों पापा, आप भी बियर लीजिये ना,\n" +
                "दे..चप्पल..पे..चप्पल !!!!"));
        jokes.add(new Joke("6. बच्चा : पापा आपने मम्मी में ऐसा क्या देखा जो शादी कर ली ?\n" +
                "पापा : उसके गाल का चोट सा तिल\n" +
                "बच्चा : कमाल है !!! इतनी सी छोटी चीज के लिए इतनी बड़ी मुसीबत मोल ले ली!!!!"));
        jokes.add(new Joke("7. अपने बेटे के रिपोर्ट कार्ड पर पिता ने अंगूठा लगाया…\n" +
                "बेटा :- पापा आप तो इंजीनियर हो, फिर ये अंगूठा क्यों?\n" +
                "पिता:- हरामखोर तेरे Marks देखकर Teacher को नहीं लगना चाहिए कि तेरे बाप पढ़ा लिखा है…"));
        jokes.add(new Joke("8. LKG के बच्चे के पेपर मे 0 आया.\n" +
                "गुस्से से पिता: यह क्या है?\n" +
                "बच्चा: पिताजी, शिक्षक के पास स्टार खत्म हो हो गए थे इसलिये उसने मून दे दिया!!!!"));
        jokes.add(new Joke("9. माता-पिता अपने बच्चे से : हमारा राजा बेटा बड़ा होकर क्या बनेगा ?\n" +
                "बच्चा : बस इतना समझदार कि 3 साल के बच्चे से ये सब ना पूछूँ!!!!"));
        jokes.add(new Joke("10. संजू अपने पिता से : पापा वो शर्मा जी का बेटा बाप बन गया\n" +
                "पिता : तो ?\n" +
                "संजू : अच्छा !!! बचपन से जब भी वो first आया आपने कहा उस जैसा बन। ……. तो आज नहीं कहोगे ???\n" +
                "पिता : भाग साले हरामखोर यहां से…."));
        jokes.add(new Joke("11. अचानक संजू ने पुछा : पापा ये मर्द कौन होता है ?\n" +
                "पिता : जो इंसान पूरे घर में अपनी हुकूमत चलाये वो मर्द होता है।\n" +
                "संजू : पापा मैं भी बड़ा होकर मम्मी की तरह ” मर्द ” बनूँगा।"));
        jokes.add(new Joke("12. बाप – इतने कम मार्क्स… दो थप्पड़ मारने चाहिए…\n" +
                "पप्पू – हाँ पापा जल्दी चलो मैंने उस साले मास्टर का घर भी देख रखा हैं…"));
        jokes.add(new Joke("13. पापा नाश्ता कर रहे थे..अचानक फोन बजा,\n" +
                "पापा – मेरे ऑफिस से होगा,पूछे तो बोल देना मैं घर पर नहीं हूँ\n" +
                "बेटी(फोन उठकर)- पापा घर पर ही हैं\n" +
                "पापा – अरे मैंने तो कहा था कि मना कर देना\n" +
                "बेटी – अरे फ़ोन मेरे लिए था..\n" +
                "पापा बेहोश… "));
        jokes.add(new Joke("14. एक बच्चा अपनी माँ से बुरी तरह से पीटने के बाद, अपने पापा से पूछा आप कभी पाकिस्तान गए हो ?\n" +
                "पापा : नहीं बेटा …..\n" +
                "बेटा: कभी अफगानिस्तान गए हो ?\n" +
                "पापा : नहीं बेटा.\n" +
                "बेटा : तो फिर यह आतंकवादी आइटम कहाँ से लाये ?? "));
        jokes.add(new Joke("15. पिता : बेटा, एक जमाना था जब मैं 10 रुपए लेकर बाजार जाता था और किराना, सब्जी, दूध सब ले आता था।\n" +
                "बेटा : पिताजी अब जमाना बदल गया है। आजकल हर दुकान पर सीसीटीवी कैमरे लगे रहते हैं!!!!"));
        jokes.add(new Joke("16. पापाः बेटा तुम्हारे रिजल्ट का क्या हुआ?\n" +
                "पप्पुः पापा 80% आये है ।\n" +
                "पापाः पर मार्कशीट पर 40% लिखा है?\n" +
                "पप्पूः बाकी के 40% आधारकार्ड लिंक होनेपर सीधे अकाऊंट में आएंगे!!!!"));
        jokes.add(new Joke("17. पिता बच्चे के रूम में जाते है..देखते ही उनका बच्चा आँखों पर चश्मा रखकर थके चेहरे से पढ़ाई करते करते सो गया है…\n" +
                "वो पास पहुंचते है ..उसके बालो पे से हलक से हाथ घुमाते है…\n" +
                "हाथ की किताब बाजू में रखते है…. \n" +
                "हलके से उसके आँखों का चश्मा निकालते है और जोर से उसके मुह में तमाचा जड़ देते है …. \n" +
                "हरामखोर मेरे WhatsApp में एक मिनट पहले तू ऑनलाइन दिख रहा है ..\n" +
                "बाप को केजरीवाल समझता है ??"));
        jokes.add(new Joke("18. एक बच्चा अपने पापा की शादी की CD देख रहा टीवी पर…\n" +
                "बच्चा- हम भी अपनी शादी मे आइटम गर्ल नचवायेगे ….!\n" +
                "पिता- हरामखोर… ये तेरी बुआ और मौसी है।"));
        jokes.add(new Joke("19. जली को आग कहते हैं…..\n" +
                "बुझी को राख कहते हैं…..\n" +
                "जिसका missed call देखते ही दारू उतर जाये.. उसे baap कहेते हैं!!!!"));
        jokes.add(new Joke("20. बच्चा – पापा आप जल्दी से जल्दी मेरी शादी करा दो,\n" +
                "पिता – क्यों बे ?\n" +
                "बच्चा – जल्दी करो नहीं तो मैं दादी से शादी कर लूँगा,\n" +
                "पिता – क्या? तू मेरी माँ से शादी करेगा?\n" +
                "बच्चा – हाँ, आपने भी तो मेरी माँ से शादी की हुई है!!!!"));
        jokes.add(new Joke("21. सारे दिन फ़ोन पे चैटिंग करते रहने का नतीजा,\n" +
                "पापा- बेटा क्या कर रहा है?\n" +
                "पप्पू- पापा वर्षा आने वाली है,\n" +
                "पापा- कुछ पढ़ लिया कर नालायक, सारे दिन लड़कियों से चैटिंग करता रहता है,\n" +
                "पप्पू- पापा मैं बारिश की बात कर रहा हूँ!!!!"));
        jokes.add(new Joke("22. बेटा पहली बार एक लड़की को लेकर घर में आया ,\n" +
                "पिता – कौन है ये लड़की ?\n" +
                "बेटा – ये मेरी गर्लफ्रेंड है ,,\n" +
                "पिता – ok\n" +
                "दूसरे दिन , लड़का किसी दूसरी लड़की के साथ ,\n" +
                "पिता(गुस्से में) – कौन है ये लड़की ?\n" +
                "बेटा – रिश्ता वही , आइटम नई.."));
        jokes.add(new Joke("23. बाप ने देखा कि बेटा जीन्स का बटन टांक रहा था….\n" +
                "बाप – बेटा, हमने तुम्हारा विवाह कराया, बहू घर आयी, फिर भी तुम अपनी जीन्स पर खुद ही बटन टांक रहे हो?\n" +
                "बेटा : पिताजी, आप गलत सोच रहे हैं… यह जीन्स उसी की है…\n" +
                "पिता जी बेहोश…..!!!!"));
        jokes.add(new Joke("24. पापा  : बेटा तुम शादी कब कर रहे हो  ?\n" +
                "\n" +
                "बेटा  : New Year पे सोच रहा हूँ\n" +
                "\n" +
                "पापा  : New Year पे ही क्यों  ?\n" +
                "\n" +
                "बेटा  : New Year पे ऑफर चलता है। 1 के साथ  1 फ्री!!!!"));
        jokes.add(new Joke("25. पप्पू  : पापा आप कभी इजिप्ट गए हो  ?\n" +
                "\n" +
                "पापा  : नहीं, लेकिन क्यों  ?\n" +
                "\n" +
                "पप्पू  : तो फिर इतनी खतरनाक मम्मी आप लाए कहाँ से हो  ?"));
        jokes.add(new Joke("26. बेटा  : पापा जल्दी से पानी लेकर मम्मी के पास चलो\n" +
                "\n" +
                "पापा  : क्यों बेटा  ?\n" +
                "\n" +
                "बेटा  : मम्मी कह रहीं थीं\n" +
                "\n" +
                "“तेरे और तेरे बाप के लक्षण देख -देखकर\n" +
                "\n" +
                "मेरे शरीर में आग लग जाती है ”"));
        jokes.add(new Joke("27. पापा  : बेटा, अमेरिका में  15 साल के बच्चे भी अपने पैरों पर खड़े हो जाते हैं\n" +
                "\n" +
                "बेटा  : लेकिन पापा, भारत में तो  2 साल का बच्चा भागने भी लगता है!!!!"));
        jokes.add(new Joke("28. पापा  : बेटा कल भूकंप कितनी तीव्रता का आया था  ?\n" +
                "\n" +
                "बेटा  : 8.0 का\n" +
                "\n" +
                "पापा  : बेटा, अब तो भूकंप के भी नंबर तुझसे ज्यादा आने लगे!!!"));
        jokes.add(new Joke("29. पापा  : क्या बात है बेटा, आजकल तू बड़ी टेंशन में रहता है\n" +
                "\n" +
                "बेटा  : पापा वो मैं आपको नहीं बता सकता\n" +
                "\n" +
                "पापा  : देखो बेटा, मुझे अपना दोस्त ही समझो\n" +
                "\n" +
                "बेटा  : क्या बताऊँ यार\n" +
                "\n" +
                "तेरी भाभी नाराज हो गयी है मुझसे आज…\n" +
                "\n" +
                "दे चप्पल  दे चप्पल!!!!"));
        jokes.add(new Joke("30. बेटा  : पापा आप ही मुझे स्कूल से लेने क्यों आते हो\n" +
                "\n" +
                "बाकी सब बच्चों को लेने तो उनकी मम्मी आती हैं\n" +
                "\n" +
                "पापा  : बस बेटा, इसीलिए…"));
        jokes.add(new Joke("31. बाप  : मैंने कहा था कि अपने नाखून काट लो, फिर अभी तक क्यों नहीं काटे  ?\n" +
                "\n" +
                "बेटा  : पापा मैंने काटे थे लेकिन आपका ड्राइवर\n" +
                "\n" +
                "गाड़ी इतने धीरे चलाता है कि नाखून रस्ते में ही बढ़ जाते हैं!!!!"));
        jokes.add(new Joke("32. बाप  : मुझे अपना  Report Card दिखाओ\n" +
                "\n" +
                "बेटा  : मेरे दोस्त ने मुझसे उधार लिया है\n" +
                "\n" +
                "बाप  : वो क्यों  ?\n" +
                "\n" +
                "बेटा  : क्योंकि वो अपने  Parents को डराना चाहता है......"));
        jokes.add(new Joke("33. बाप  : क्या कर रहे हो बेटा  ?\n" +
                "\n" +
                "बेटा  : पापा बस नहाने जा रहा हूँ\n" +
                "\n" +
                "बाप  : वो सब तो ठीक है पर\n" +
                "\n" +
                "आगे के लिए क्या सोचा है  ?\n" +
                "\n" +
                "बेटा  : बस बाल्टी भर जाए फिर मोटर बंद कर दूँगा\n" +
                "\n" +
                "पापा बेहोश...."));
        jokes.add(new Joke("34. बाप  : तुम्हारे  Result का क्या रहा  ?\n" +
                "\n" +
                "बेटा  : प्रिंसिपल का बेटा फेल हो गया\n" +
                "\n" +
                "बाप  : तुम…\n" +
                "\n" +
                "बेटा  : मेजर साहब का बेटा भी फेल हो गया\n" +
                "\n" +
                "बाप  : और तुम…\n" +
                "\n" +
                "बेटा  : डॉक्टर साहब का बेटा भी फेल हो गया\n" +
                "\n" +
                "बाप  : इडियट, मैं तुमसे पूँछ रहा हूँ\n" +
                "\n" +
                "तुम्हारा क्या हुआ  ?\n" +
                "\n" +
                "बेटा  : तो आप कौन से प्रधान मंत्री हो जो\n" +
                "\n" +
                "आपका बेटा पास हो जाएगा!!!!"));
        jokes.add(new Joke("35. बाप ने बेटे की तलाशी ली\n" +
                "\n" +
                "सिगरेट, बिअर और गर्ल्स के नंबर निकले\n" +
                "\n" +
                "बाप ने बेटे को बहुत मारा और पूँछा\n" +
                "\n" +
                "“कब से चल रहा है ये सब ”\n" +
                "\n" +
                "बेटा (रोते हुए ) : पापा ये जैकेट तो आपकी ही है!!!!"));
        jokes.add(new Joke("36. एक बार एक लड़का दारू पीकर घर लौटा\n" +
                "\n" +
                "बाप से बचने के लिए चुपचाप  Laptop खोलकर पढ़ने लगा\n" +
                "\n" +
                "बाप  : दारू पीके आया है  ?\n" +
                "\n" +
                "बेटा  : नहीं तो\n" +
                "\n" +
                "बाप  : तो सूटकेस खोलकर क्या पढ़ रहा है  ?"));
        jokes.add(new Joke("37. बाप  : अगर तू इस बार भी  Exam में फेल हुआ तो मुझे पापा मत बोलना\n" +
                "\n" +
                "रिजल्ट  के बाद…\n" +
                "\n" +
                "बाप  : कैसा रहा तेरा रिजल्ट  ?\n" +
                "\n" +
                "बेटा  : दिमाग मत ख़राब कर रोशनलाल\n" +
                "\n" +
                "तूने बाप होने का हक़ खो दिया है....."));
        jokes.add(new Joke("38. बेटा  : पापा, शादी करने में कितना खर्चा आता है  ?\n" +
                "\n" +
                "बाप  : पता नहीं बेटा, मैं तो अभी तक खर्चा कर रहा हूँ....."));
        jokes.add(new Joke("39. बेटा  : पापा एक खुशखबरी है\n" +
                "\n" +
                "पापा  : क्या  ?\n" +
                "\n" +
                "बेटा  : आपने कहा था कि अगर मैं पास हो गया तो आप गाड़ी दिलाएँगे\n" +
                "\n" +
                "पापा  : हाँ तो\n" +
                "\n" +
                "बेटा  : आपके रुपये बच गए...."));
        jokes.add(new Joke("40. बेटा  : पापा, सुखी वैवाहिक जीवन का राज  ?\n" +
                "\n" +
                "बाप  : बेटा, आज भी राज है....."));
        jokes.add(new Joke("41. बाप  : बेटा इस बार तेरे  90% नंबर आने चाहिए\n" +
                "\n" +
                "बेटा  : नहीं पापा इस वार मैं  100% लाऊंगा\n" +
                "\n" +
                "बाप  : क्यों मजाक कर रहा है  ?\n" +
                "\n" +
                "बेटा  : शुरू किसने किया था!!!!"));
        jokes.add(new Joke("42. बाप  : क्यों रो रहे हो बेटा  ?\n" +
                "\n" +
                "बेटा  : टीचर ने मारा\n" +
                "\n" +
                "बाप  : जरूर तुमने  Class में कुछ गलती की होगी\n" +
                "\n" +
                "बेटा  : नहीं पापा, मैं तो  Class में चुपचाप सो रहा था!!!"));
        jokes.add(new Joke("43. मानसी आधे घंटे से फ़ोन पे किसी से बात कर रही थी।\n" +
                "\n" +
                "पिता को देखा तो उसने फ़ोन रख दिया।\n" +
                "\n" +
                "पिता  : बेटा मानसी, आज तुमने फ़ोन बहुत जल्दी रख दिया, क्या हुआ  ?\n" +
                "\n" +
                "मानसी  : Wrong Number था पापा...."));


        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        JokeAdapter adapter = new JokeAdapter(getActivity(), jokes);

        listView.setAdapter(adapter);

        return rootView;
    }
    @Override
    public void onAdsLoaded() {
        if (getActivity() == null) {
            return;
        }

        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        NativeAdRecyclerAdapter adapter =
                new NativeAdRecyclerAdapter(getActivity(), jokes, mNativeAdsManager);
        listView.setAdapter(adapter);
    }

    @Override
    public void onAdError(AdError error) {}


}