package com.nakulbhoria.funnyhindijokes;


import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.DividerItemDecoration;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.facebook.ads.AdError;
import com.facebook.ads.NativeAdsManager;

import java.util.ArrayList;

/**
 * A simple {@link Fragment} subclass.
 */
public class HusbandWifeJokesFragment extends Fragment implements NativeAdsManager.Listener {


    final ArrayList<Joke> jokes = new ArrayList<>();
    private NativeAdsManager mNativeAdsManager;
    private RecyclerView listView;

    public HusbandWifeJokesFragment() {
        // Required empty public constructor
    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        String placement_id = "1869998493118528_1870003033118074";
        mNativeAdsManager = new NativeAdsManager(getActivity(), placement_id, 0);
        mNativeAdsManager.loadAds();
        mNativeAdsManager.setListener(this);

        View rootView = inflater.inflate(R.layout.joke_list, container, false );
        listView = rootView.findViewById(R.id.list);
        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        jokes.add(new Joke("1. बीवी पति से:\n" +
                "तुम ठीक से रहोगे तो बीजेपी के चुनाव चिन्ह से स्वागत करुँगी..!\n" +
                "\n" +
                "ज्यादा समझदारी दिखाई तो\n" +
                "फिर कांग्रेस के चुनाव चिन्ह से…!\n" +
                "\n" +
                "उसके बाद भी अकड़ोगे तो फिर…..\n" +
                "‘आप’ का चुनाव चिन्ह दरवाजे के पीछे रखा है…ध्यान रहे…!"));
        jokes.add(new Joke("2. Rose Day\n" +
                "Propose Day\n" +
                "Chocolate Day\n" +
                "Teddy Day\n" +
                "Promise Day\n" +
                "Kiss Day\n" +
                "Hug Day\n" +
                "VALENTINES DAY\n" +
                "\n" +
                "ये सब शादी के पहले के चोंचले है\n" +
                "\n" +
                ".\n" +
                "\n" +
                "शादी के बाद तो सिर्फ\n" +
                "टिफिन दे\n" +
                "चाय दे\n" +
                "रुमाल दे\n" +
                "कंबल दे\n" +
                "सोने दे\n" +
                "मुझे जीने दे!!"));
        jokes.add(new Joke("3. पत्नि मायके से वापिस आयी,,,\n" +
                "पति दरवाजा खोलते हुये जोर जोर से हसने लगा,,,,\n" +
                "\n" +
                "पत्नि: ऐसे क्यो हसं रहे हो ,,!!!!\n" +
                "पति: गुरूजी ने कहा था कि जब भी मुसीबत सामने आये उसका सामना हंसते हुये करो !!!"));
        jokes.add(new Joke("4. मकर संक्रांति पर अपनी पत्नी\n" +
                "\n" +
                "का फोटु पतंग पर चिपकाइए…..\n" +
                "\n" +
                "और ऊँगली पर नचाने का आनंद उठाइये….\n" +
                "\n" +
                "यह ऑफर सिर्फ मकर संक्रांतिके लिए है….."));
        jokes.add(new Joke("5. जो लोग हमेंशा ऑफिस में ओवर टाइम करते है,\n" +
                "क्या वो सबसे महेनती है???\n" +
                "\n" +
                "नहीं,\n" +
                "\n" +
                "या तो वो बीवी से तंग है\n" +
                "या वो ऑफिस में किसी के संग है।।।।"));
        jokes.add(new Joke("6. पत्नी चांदनी रात में अपने पति के\n" +
                "साथ लेटी थी\n" +
                "\n" +
                "पत्नी – जानू तुम्हें मुझमें क्या अच्छा लगता है…?\n" +
                "\n" +
                "पति – मुझे तुमसे जुडी हर चीज़ अच्छी लगती है डार्लिंग…\n" +
                "पत्नी – जैसे कि बताओ ना…?\n" +
                "\n" +
                "पति –\n" +
                "जैसे तुम्हारी छोटी बहन प्रिया…\n" +
                "तुम्हारी मौसी की लड़की शालू…\n" +
                "तुम्हारी मामी की लड़की शीतल।.\n" +
                "तुम्हारी बुआ की लड़की नेहा..\n" +
                "तुम्हारे पडोसी की बेटी ममता…\n" +
                "तुम्हारी सहेली पिंकी…\n" +
                "\n" +
                "पति के दोनों घुटनों और जबडे का इलाज चल रहा है!!!"));
        jokes.add(new Joke("7. एक पत्नी के सुविचार:\n" +
                "\n" +
                "काश तुम अदरक होते…\n" +
                "कसम से, जी भर के कूटती !!"));
        jokes.add(new Joke("8. मायके से पत्नी फोन पर:-\n" +
                "\n" +
                "Wife: आपके बिना जी नहीं लगता..\n" +
                "\n" +
                "Husband: अरे पगली,\n" +
                "ZEE नहीं लगता तो\n" +
                "स्टार और सोनी लगा कर देख लिया कर..\n" +
                "वो भी अच्छे चैनल हैं!"));
        jokes.add(new Joke("9. पती पत्नी के बीच लड़ाई हुई…\n" +
                "पत्नी बाजार जाके जहर लाई और खा लिया….\n" +
                "\n" +
                "लेकिन वो मरी नही बिमार हो गई..\n" +
                "\n" +
                "पति गुस्से से बोला…\n" +
                "सौ बार कहा है चीजें देख कर खरीदा करो,\n" +
                "पैसे भी गये, काम भी नही हुआ।"));
        jokes.add(new Joke("10. डॉक्टर: वाइफ की तबियत कैसी है??\n" +
                "\n" +
                "हस्बैंड :-\n" +
                "अब ठीक है…\n" +
                "“सुबह तो लड़ी भी थी”!!"));
        jokes.add(new Joke("11. हरीश: तुम्हारी आंख क्यों सूजी हुई है ?\n" +
                "\n" +
                "पप्पू: कल मैं अपनी पत्नी के जन्मदिन पर केक लाया था।\n" +
                "\n" +
                "हरीश: लेकिन इसका आंख सूजने से क्या संबंध है?\n" +
                "\n" +
                "पप्पू: मेरी पत्नी का नाम तपस्या है लेकिन केक वाले बेवकूफ दुकानदार ने लिख दिया “हैप्पी बर्थडे समस्या”!"));
        jokes.add(new Joke("12. डॉक्टर-\n" +
                "रात में टेंशन लेकर नही सोना चाहिये ।\n" +
                "\n" +
                "मरीज –\n" +
                "तो क्या मायके भेज दें..?"));
        jokes.add(new Joke("13. पत्नी:- तुम मुझसे कितना प्यार करते हो ?\n" +
                "\n" +
                "पति:- 72%\n" +
                "\n" +
                "पत्नी:- 100% क्यों नही??\n" +
                "\n" +
                "पति:-\n" +
                "28% तो GST है ना पगली,\n" +
                "लक्ज़री आइटम पर।"));
        jokes.add(new Joke("14. बीवी पति से:\n" +
                "सुनिये जी वो आदमी जो दारू पी कर नाच रहा है ना,\n" +
                "मैने उसे 10 साल पहले रिजेक्ट कर दिया था\n" +
                "\n" +
                "पति:\n" +
                "बताओ, साला अभी तक celebrate कर रहा है !!"));
        jokes.add(new Joke("15. आजकल घर मे बीवी भी बात-बात में GST बोलने लगी है।\n" +
                "घर में कैसी भी बहस चल रही हो वो GST बोल कर बहस को ख़त्म कर देती है।\n" +
                "\n" +
                "तंग आकर मैंने पूँछ ही लिया: “ये तुम बात करते-करते बीच में ही GST बोल कर चल देती हो…क्या मतलब है तुम्हारा ??”\n" +
                "\n" +
                "और उसने जो जवाब दिया तो मैं सर पकड़ कर बैठ गया।\n" +
                "\n" +
                "G – गलती\n" +
                "S – सिर्फ\n" +
                "T – तुम्हारी है"));
        jokes.add(new Joke("16. बीवी बादाम खा रही थी\n" +
                "पति बोला मुझे भी taste कराओ\n" +
                "\n" +
                "बीवी ने एक बादाम दे दिया\n" +
                "पति : बस एक\n" +
                "\n" +
                "बीवी हाँ, बाकी सबका भी ऐसा ही #Taste है।"));
        jokes.add(new Joke("17. कौन बनेगा करोड़पति में मुझसे 5 करोड़ का सवाल पुछा गया कि “आपकी नज़र में दुनिया की सबसे खतरनाक महिला कौन है?”\n" +
                "\n" +
                "कसम से मैने 5 करोड़ को ठोकर मार दी पर नाम नही बताया क्यों कि शाम को घर भी जाना था।"));
        jokes.add(new Joke("18. भोलेनाथ: मांगो वत्स क्या चाहिए?\n" +
                "\n" +
                "भक्त :\n" +
                "मुझे पत्नी के साथ लड़ने की\n" +
                "शक्ति दो।\n" +
                "हिम्मत दो।\n" +
                "बुद्धि दो प्रभु।\n" +
                "\n" +
                "भोलेनाथ: इसको एक तरफ बैठाओ शायद भांग ज्यादा पी गया है।"));
        jokes.add(new Joke("19. अमरेंद्र बाहुबली, लड़कियो और महिलाओं को क्यों पसंद आया ??\n" +
                "पता है…..?\n" +
                "\n" +
                "वो दिखने मे सुंदर था, इसलिये?\n" +
                "नहीं\n" +
                "\n" +
                "वो महापराक्रमी था, इसलिये?\n" +
                "नही\n" +
                "\n" +
                "वो रोमेंटिक था, इसलिये ??\n" +
                "बिलकुल नहीं,\n" +
                "\n" +
                "वो इसलिये,\n" +
                "क्योंकि भरी सभा मे वो बीवी का पक्ष लेकर कह सका कि, “माँ” तुम गलत हो!\n" +
                "\n" +
                "▬▬▬▬▬▬\n" +
                "थियेटर मे 99% महिलायें इस डायलाग के बाद अपने पति की तरफ देख रही थी!!"));
        jokes.add(new Joke("20. पत्नी :-\n" +
                "मेरी ये समझ में नहीं आता की कई साल से मैं करवा चौथ का व्रत नहीं रख रही\n" +
                "फिर भी तुम पूर्ण स्वस्थ कैसे रहे हो।\n" +
                "\n" +
                "पति :-\n" +
                "मैं बहुत नियम संयम से रहता हूँ इसलिए।\n" +
                "\n" +
                "पत्नी :-\n" +
                "मुझे बेवक़ूफ़ समझ रखा है क्या ?\n" +
                "सच सच बताओ वह कौन है\n" +
                "जो तुम्हारे लिए करवा चौथ का व्रत रखती है"));
        jokes.add(new Joke("21. अगर वाइफ के साथ\n" +
                "वेकेशन पर जा रहे हैं\n" +
                "\n" +
                "तो वह वेकेशन नहीं,\n" +
                "मात्र चेंज ऑफ़ लोकेशन ही हैं!"));
        jokes.add(new Joke("22. पति ने पत्नी को मेसेज भेजा-\n" +
                "मेरी जिंदगी इतनी प्यारी, इतनी खूबसूरत बनाने के लिए तुम्हारा शुक्रिया।\n" +
                "मैं आज जो भी हूं, सिर्फ तुम्हारी वजह से हूं।\n" +
                "तुम मेरे जीवन में एक फरिश्ता बनकर आई हो\n" +
                "और तुमने ही मुझे जीने का मकसद दिया है। लव यू..’\n" +
                "\n" +
                "पत्नी ने रिप्लाई किया-\n" +
                "मार लिया चौथा पैग? आ जाओ घर कुछ नही कहूँगी। :\n" +
                "\n" +
                "पति – बाहर खड़ा हूँ, गेट खोल दे!"));
        jokes.add(new Joke("23. पति : पानी पिलाओ\n" +
                "\n" +
                "पत्नी पानी लेने गयी, तब तक पति सो गया ,\n" +
                "पत्नी सारी रात पानी का गिलास पकड़े खड़ी रही ,\n" +
                "\n" +
                "सुबह जब पति की आँख खुली तो देख के बहुत खुश हुआ\n" +
                "और बोला मांगो क्या मांगती हो ?\n" +
                "\n" +
                "पत्नी : तलाक दे दे कमीने!!"));
        jokes.add(new Joke("24. पत्नी (पति से):\n" +
                "जी आपको याद है कि जब आप मुजे देखने आऐ थे तब मैने किस रंग की साडी पहनी थी…??\n" +
                "\n" +
                "पति:नही..\n" +
                "\n" +
                "पत्नी: ईस का मतलब की आप मुझसे प्यार नहीं करते…\n" +
                "\n" +
                "पति: अरे एसी बात नहीं है..\n" +
                "जब कोई पटरी पर लेटने जाता है तब वो ये थोड़ी देखता है की ट्रेन शताब्दी है या ऐक्सप्रेस."));
        jokes.add(new Joke("25. कल रात एक शादी में गया ।\n" +
                "\n" +
                "वहां, जैसे ही डीजे ने यह गाना बजाया…\n" +
                "‘जिसको डांस नहीं करना वो जाकर अपनी भैंस चराए’\n" +
                "\n" +
                "ज्यादातर पति अपनी पत्नी को खाना खिलाने ले गए !!!"));
        jokes.add(new Joke("26. पत्नी बीमार पति को डाक्टर के पास ले गयी.\n" +
                "\n" +
                "डाक्टर ने कहा :\n" +
                "इनको अच्छा खाना दो,\n" +
                "हमेशा खुश रखो, घर की कोई भी प्राब्लम इनसे डिसकस ना करो,\n" +
                "फाल्तू की फरमाइशें करके इनकी चिंताये मत बढ़ाओ ,\n" +
                "तो ये छ महीने में ठीक हो जायेंगे.\n" +
                "\n" +
                "रास्ते में पति ने पत्नी से पूछा:\n" +
                "क्या कहा डाक्टर ने ?\n" +
                "\n" +
                "पत्नी बोली:\n" +
                "कुछ नही, अब डाक्टर ने भी जवाब दे दिया है"));
        jokes.add(new Joke("27. एक आदमी अपनी बीवी को दफना के घर जा रहा था\n" +
                "\n" +
                "कि अचानक बिजली चमकी बादल गरजे जोर की तूफानी\n" +
                "बारिश शुरू हुई !\n" +
                "माहौल अफरातफरी वाला हो गया\n" +
                "\n" +
                "दुखी आदमी आसमान की तरफ देखते हुए बोला\n" +
                "\n" +
                "लगता हैं पहुँच गयी !!"));
        jokes.add(new Joke("28. पार्टी में सुन्दर लड़की से हंस हंस कर बातें कर रहे पति के पास पत्नी आई और बोली,\n" +
                "\n" +
                "चलिये,\n" +
                "घर चल कर मॆं आपकी चोट पे iodex लगा दूँगी।\n" +
                "पति…\n" +
                "पर मुझे चोट कहाँ लगी है।\n" +
                "\n" +
                "पत्नी…\n" +
                "अभी हम घर भी कहाँ पहुंचे हैं।????"));
        jokes.add(new Joke("29. भक्त-\n" +
                "भगवान मैं पापी हूं!\n" +
                "\n" +
                "मुझे दर्द दो,\n" +
                "दुख दो,\n" +
                "मुझे बर्बाद कर दो,\n" +
                "परेशानी दो,\n" +
                "मेरे पीछे भूत लगा दो!\n" +
                "\n" +
                "भगवान- अबे एक लाइन में बोल ना कि बीवी चाहिए !"));
        jokes.add(new Joke("30. वो कौनसी चीज है\n" +
                "जो हमेशा आपकी ही रहेगी\n" +
                "आपकी बीवी की नहीं हो सकती ?\n" +
                "\n" +
                ".\n" +
                "\n" +
                ".\n" +
                "\n" +
                "गलती ..!!"));


        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        JokeAdapter adapter = new JokeAdapter(getActivity(), jokes);

        listView.setAdapter(adapter);

        return rootView;
    }
    @Override
    public void onAdsLoaded() {
        if (getActivity() == null) {
            return;
        }

        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        NativeAdRecyclerAdapter adapter =
                new NativeAdRecyclerAdapter(getActivity(), jokes, mNativeAdsManager);
        listView.setAdapter(adapter);
    }

    @Override
    public void onAdError(AdError error) {}


}