package com.nakulbhoria.funnyhindijokes;


import android.support.v4.app.Fragment;
import android.os.Bundle;
import android.support.v7.widget.DividerItemDecoration;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.facebook.ads.AdError;
import com.facebook.ads.NativeAdsManager;

import java.util.ArrayList;

/**
 * A simple {@link Fragment} subclass.
 */
public class KanpuriyaJokesFragment extends Fragment implements NativeAdsManager.Listener {


    final ArrayList<Joke> jokes = new ArrayList<>();
    private NativeAdsManager mNativeAdsManager;
    private RecyclerView listView;

    public KanpuriyaJokesFragment() {
        // Required empty public constructor
    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        String placement_id = "1869998493118528_1870003033118074";
        mNativeAdsManager = new NativeAdsManager(getActivity(), placement_id, 0);
        mNativeAdsManager.loadAds();
        mNativeAdsManager.setListener(this);

        View rootView = inflater.inflate(R.layout.joke_list, container, false );

        listView = rootView.findViewById(R.id.list);
        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        jokes.add(new Joke("1. टीचर (लड़के से) : “काहे बे… कल स्कूल काहे नहीं आए…..??”\n" +
                "\n" +
                "लड़का : “काहे… कल जौ आये रहें… उनका कलेक्टर बना दिए हो का…??”"));
        jokes.add(new Joke("2. हप्पुसिंह – डाक्टर साब हमाओ इलाज कर दे|\n" +
                "डॉक्टर – तुम्हारा ये हाल कैसे हुआ?\n" +
                "\n" +
                "हप्पुजी– छत पे धरी थी 500 ईँटे, सब नेंचे ल्याने थी,\n" +
                "\n" +
                "ऐसे 5-10 करके ल्याते तो परेशान हो जाते ।\n" +
                "सो हमने एक उपाय सोचो ।\n" +
                "\n" +
                "छत पे धरी हती एक टंकी,\n" +
                "टंकी मे भर दई 500 ईँटे,\n" +
                "फिर एक रस्सा बांद दओ\n" +
                "और कुन्दा मे फँसाकें रस्सा नेंचे लटका दओ ।\n" +
                "\n" +
                "हमने नेंचे जाके रस्सा पकडो\n" +
                "सो टंकी नेंचे लटक\n" +
                "गई ।\n" +
                "\n" +
                "अब टंकी 500 किलो की\n" +
                "और हम धरे 50 किलो के\n" +
                "सो टंकी सरसरात नेंचे आ रई और हम सरसरात ऊपर\n" +
                "जा रए।\n" +
                "कुंदा से सर फूट गओ\n" +
                "\n" +
                "टंकी जैसई नेंचे गिरी\n" +
                "सो उको तल्ला खुल गओ\n" +
                "और\n" +
                "सब ईँटे बाहर कड़ गई।\n" +
                "\n" +
                "अब टंकी बची 25 किलो की\n" +
                "और हम हते 50 किलो के,\n" +
                "सो हम सरसरात नेंचे आ रए\n" +
                "और टंकी सरसरात ऊपर\n" +
                "जा रई।\n" +
                "हम जैसई गिरे ईटो के ढेर पे\n" +
                "\n" +
                "सो हमाई करहाई टूट गई।\n" +
                "और\n" +
                "हमाए हाथ से रस्सा छूट गओ\n" +
                "\n" +
                "अब रस्सा सरसरात ऊपर जा रओ\n" +
                "और टंकी सरसरात नेंचे\n" +
                "आ रई\n" +
                "और गिरी हमाई मूड़ पे,\n" +
                "सो हमाई खपड़िया फूट\n" +
                "गई।\n" +
                "बडी बिटम्मना है\n" +
                "अब तुमई अच्छो इलाज करो डाक्टर साब ।\n" +
                "\n" +
                "डॉक्टर साहब बेहोश!"));
        jokes.add(new Joke("3. एक कनपुरिया 30 साल तपस्या करता है \n" +
                "और भगवान प्रसन्न होकर उसे अमृत देते हैं। \n" +
                ".\n" +
                "लेकिन, कनपुरिया अमृत पीने से मना कर देता है। \n" +
                ".\n" +
                "भगवान पूछते हैं, काहे नहीं पियोगे अमृत? \n" +
                "\n" +
                "कनपुरिया: अभी-अभी मसाला खाए हैं प्रभु। "));
        jokes.add(new Joke("4. एक बार की बात है भारत में एक भारतीय गाइड किसी विदेशी पर्यटक को दिल्ली घुमा रहा था।\n" +
                ".\n" +
                "भारतीय गाइड ने कहा:- \"यह हमारा संसद भवन है।\"\n" +
                ".\n" +
                "विदेशी पर्यटक ने कहा:- बस….?\n" +
                ".\n" +
                "इतना बड़ा तो हमारे\n" +
                "यहाँ पिज्जा होता है।\"\n" +
                ".\n" +
                "भारतीय गाइड चुप रहा और उसे आगे ले गया।\n" +
                ".\n" +
                "फिर बोला :-\"यह है हमारा लाल किला।\n" +
                ".\n" +
                "विदेशी पर्यटक बोला:- बस….?\n" +
                "इतना तो हमारे यहां बर्गर होता है।\"\n" +
                ".\n" +
                "भारतीय गाइड को गुस्सा तो बहुत आ रहा था मगर वह चुप रहा।\n" +
                ".\n" +
                "भारतीय गाइड उसे आगे कुतुब मीनार दिखाने पहुँचा।\n" +
                ".\n" +
                "विदेशी पर्यटक ने पूछा, :-\"ये क्या है?\"\n" +
                ".\n" +
                "भारतीय गाइड बोला, :-\"ये तुम्हारे पिज्जा ऒर बर्गर पर टोमेटो सास डालने की बोतल है।"));
        jokes.add(new Joke("5. रावण - माई भिक्षा दे ..\n" +
                "महिला  - ले लो महाराज...\n" +
                "रावण - माई ... जरा यह द्वार पार करके बाहर तो आना...\n" +
                "वह द्वार पार करके बाहर आती है...\n" +
                "रावण - (उसे पकड़ते हुए ) हा .. हा ... हा ... मैं भिक्षुक नहीं, रावण हूं....\n" +
                "महिला - हा .. हा ... हा ... मैं भी सीता नहीं.... कामवाली बाई हूं\n" +
                "कहानी में फिर ट्विस्ट :\n" +
                "रावण : हा..हा..हा...मुझे भी कामवाली बाई की ही जरूरत है,सीता का अपहरण करके आज तक पछता रहा हूं, तुम्हें ले जाऊंगा तो मंदोदरी खुश हो जायेगी"));
        jokes.add(new Joke("6. एक पंजाबी दामाद अपनी ससुराल लखनऊ गया.. \n" +
                "उसने लखनऊ की तहज़ीब और तमीज़ के बारे में बहुत सुना था...\n" +
                "तभी सास आई और पूछा :- क्या बैँगन शरीफ पका लूँ \n" +
                "या आप मियां आलू नोश फरमाएंगे  \n" +
                "या फिर भिन्डी मोहतरम खाना पसंद \n" +
                "करेंगे ???\n" +
                "\n" +
                "पंजाबी दामाद बोला : मैं गुनहगार बंदा हूँ।\n" +
                "इनके काबिल कहाँ,, \n" +
                "कोई बेगैरत सा मुर्गा पका लें !!"));
        jokes.add(new Joke("7. टीचर :- एक तरफ पैसा,\n" +
                "दुसरी तरफ अक्कल, क्या चुनोगे ?\n" +
                "विद्यार्थीः पैसा.\n" +
                "टीचर :- गलत,मै अक्कल\n" +
                "चुनती\n" +
                "विद्यार्थीः- आप सही कह रही हो मेडम,\n" +
                "जिसके पास जिस चीज की कमी होती है वो वही चुनता है ...............\n" +
                "दे  थप्पड़   दे चपेट\n" +
                "दे  थप्पड़  दे चपेट........ "));
        jokes.add(new Joke("8. संता दो सिगरेट एक साथ पीता था.\n" +
                "पत्नी – \" दो सिगरेट क्यों पीते हो \"\n" +
                "संता – \" दोस्त की बहुत याद आती है इसलिए एक मेरी होती है और एक मेरे दोस्त की \"\n" +
                "कुछ दिनों बाद संता एक ही सिगरेट पीने लगा.\n" +
                "पत्नी ने पूछा – \" दोस्त को भूल गए क्या \"\n" +
                "संता – \" नहीं पगली, मैंने सिगरेट पीना छोड़ दिया है \""));
        jokes.add(new Joke("9. उपवास का मथुरा  version\n" +
                "पति-. का बात है आज रोटी नाए बनायीं का..? जे रस अकेलो काये पी रई हैं.?\n" +
                "पत्नी, - आज हमाओ उपास है न..\n" +
                "पति-तो कछु खाए लेती काहे कू  भूखी है.\n" +
                "पत्नी- हओ तनक फलाहार कर लिओ है.\n" +
                "4 केला \n" +
                "2 अनार \n" +
                "3 सेव \n" +
                "\n" +
                "हलुआ , साबुदान की खिचड़ी, सिंगाड़ा की पूड़ी बस लओ है..\n" +
                "धौताएं 1 गिलास दूध और\n" +
                "दो कप चाय पी लई हती..\n" +
                "\n" +
                "अब जौ मुसंबी को रस पी रये..तो तुमने टोक दयो... \n" +
                "आज ऊपास है न, सो कछु और नाएं खा सकत..\n" +
                "पति- तनक रबड़ी सबड़ी और ले लेतीं..\n" +
                "\n" +
                "पत्नी -हओ रात के ब्यारी के बाद रबड़ी खाउगी .. खानो एकइ टेम खा सकत ए..\n" +
                "\n" +
                "पति- भाई भोतइ कठिन उपास है तुमाओ तो....\n" +
                "कोउ को बाप नाइँ कर सके ऐसो कठिन उपास..\n" +
                "देखियो.. कमजोरी नाए आ जाये तोए.\n" +
                "\n" +
                "पत्नी-जई से तो बीच बीच में\n" +
                "बदाम काजू फांक लए..\n" +
                "\n" +
                "पति- फिरउ. ख्याल रखियो अपनों..!"));
        jokes.add(new Joke("10. पत्रकार इन्द्राणी मुखर्जी से:\n" +
                "\"मैडम आप इतने सारे पतियो के नाम मोबाइल में कैसे save करती थी?\"\n" +
                "इन्द्राणी: \"\n" +
                "1 अभी का हबी\n" +
                "2  हबी था कभी\n" +
                "3  पहले का जानू\n" +
                "4 अब ना जानू\n" +
                "5 जानू या ना जानू"));
        jokes.add(new Joke("11. अपनी माँ से हमेशा सच कहो…\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                "और सच बोलते ही भाग लो…           \n" +
                "क्योंकि चप्पल की रफ़्तार आपसे कई गुणा तेज होती है…"));
        jokes.add(new Joke("12. वॉट्स अप की अवस्था कुंभ मेले जैसी हो गई है..\n" +
                "चारो तरफ आखाडे ही आखाडे..(ग्रुप ही ग्रुप)..\n" +
                "किसी मे एक तो किसी मे २-३-४ महंत..(एडमिन)..\n" +
                "कुछ साधू नियमित प्रवचन करते है (बहुत एक्टिव मेंबर्स)..\n" +
                "कुछ हफ्ते मे एक दो बार..(कम एक्टिव मेंबर्स)..\n" +
                "कुछ  साधू जो बस सिर्फ लंगर खाते रहते है.. ( निठले मेबर्स जो बस पोस्ट पढ़ते रहते है).."));
        jokes.add(new Joke("13. इतिहास गवाह है\n" +
                "ये बात आज तक किसी लडकी ने नही कही है\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                "\"तूम काट दो फ़ोन मैं लगाती हुँ\""));
        jokes.add(new Joke("14. ये सुनकर कटप्पा  फरार हो गया है..\n" +
                "की\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ". \n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "बाहुबली मर्डर केस की \n" +
                "जाँच \n" +
                "\"सँध्या बिँदणी\"\n" +
                "करेगी... "));
        jokes.add(new Joke("15. हमारी अधूरी कहानी गाना इतना रोमांटिक\n" +
                "है !\n" +
                ".\n" +
                "गाना सुनते ही मैं अपनी GF को मिस करने\n" +
                "लगा।\n" +
                ".\n" +
                "साला बाद में याद आया मेरी तो कोई GF ही\n" +
                "नहीं है !!"));
        jokes.add(new Joke("16. दुनिया के किसी भी पिता ने अपने पुत्र को पढ़ाई का महत्व इतने सरल तरीके से नहीं बताया होगा _____\n" +
                "\n" +
                "परीक्षा मे तेरे द्वारा दिया गया हर गलत उत्तर तेरे भविष्य मे होने वाले हनीमून को स्विसज़रलेण्ड से बहादुरगढ ले जाएगा ये ध्यान रखना।\n" +
                "\n" +
                "\n" +
                "लड़का तुरंत पढ़ने बैठ गया ...."));
        jokes.add(new Joke("17. पती ( अपनी पत्नी से )- I Love u\n" +
                "पत्नी - I Love u too ...\n" +
                "मै तुम्हारे लिये पुरी दुनिया से लड जाऊंगी...\n" +
                "...\n" +
                "पती- लेकिन तुम तो सबसे ज्यादा मुझसे ही लडती हो\n" +
                "पत्नी - जानू....तुम्ही तो मेरी दुनिया हो.."));
        jokes.add(new Joke("18. मुर्गी - 140 ₹ किलो\n" +
                "\n" +
                "तुर (अरहर) दाल - 140 ₹ किलो\n" +
                "\n" +
                "मोदी भारत के पहले प्रधानमंत्री हैं जिन्होंने घर की मुर्गी दाल बराबर कर दी है।"));
        jokes.add(new Joke("19. आजकल वो लड़कियां Boyfriend के पैसे से मल्टीप्लैक्स में\n" +
                "फिल्में देखने लगी है...\n" +
                "जो कभी\n" +
                "पड़ोसी के घर में जमीन पर बैठ कर\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                ".\n" +
                "शक्तिमान देखती थी!!!!"));
        jokes.add(new Joke("20. Facebook - 'दर्द' सभी इंसानो मे है मगर .. \n" +
                "कोई दिखाता है तो, कोई छुपाता है.\n" +
                "'हमसफर' सभी है मगर ..\n" +
                "कोई साथ देता है तो, कोई छोड देता है.\n" +
                "'प्यार' सभी करते है मगर ..\n" +
                "कोई दिल से करता है तो, \n" +
                "कोई दिमाग सें करता है.\n" +
                "'दोस्ती' सभी करते है मगर .. \n" +
                "कुछ लोग निभाते है, \n" +
                "कुछ लोग आजमाते है..\n" +
                "'रिश्ता' कई लोगों से होता है मगर .. \n" +
                "कोई प्यार से निभाता है तो, \n" +
                "कोई नफरत से निभाता है.\n" +
                "'अहसास' सबको होता है मगर .. \n" +
                "कोई महसूस करता है तो, \n" +
                "कोई समझ नही पाता.\n" +
                "'जिंदगी' सभी जीते है मगर … \n" +
                "कोई सबकुछ आने के बाद भी दुखी रहते है, तो, \n" +
                "कोई लुटाके खुश रहते है .."));
        jokes.add(new Joke("21. अपने group के कुछ बंदे  तलवार लेकर बड़े जोश से ....\n" +
                "इधर उधर भाग रहे थे ....\n" +
                "मैने पूछा क्या हुआ ....\n" +
                "क्यो भाग रहे हो?????..\n" +
                "एक बंदा बोला कटप्पा ने बाहुवली को मारा है लेकिन ....\n" +
                "नाम अपने ऐडमीन  का आ रहा है ......\n" +
                "लाशे बिछा देंगे लाशे......."));

        // Create an {@link JokeAdapter}, whose data source is a list of {@link Joke}s. The
        // adapter knows how to create list items for each item in the list.


        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        JokeAdapter adapter = new JokeAdapter(getActivity(), jokes);
        // Find the {@link ListView} object in the view hierarchy of the {@link Activity}.
        // There should be a {@link ListView} with the view ID called list, which is declared in the
        // joke_list.xml layout file.


        // Make the {@link ListView} use the {@link JokeAdapter} we created above, so that the
        // {@link ListView} will display list items for each {@link Joke} in the list.
        listView.setAdapter(adapter);

        return rootView;

    }
    @Override
    public void onAdsLoaded() {
        if (getActivity() == null) {
            return;
        }

        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        NativeAdRecyclerAdapter adapter =
                new NativeAdRecyclerAdapter(getActivity(), jokes, mNativeAdsManager);
        listView.setAdapter(adapter);
    }

    @Override
    public void onAdError(AdError error) {}


}