package com.nakulbhoria.funnyhindijokes;


import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.DividerItemDecoration;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.facebook.ads.AdError;
import com.facebook.ads.NativeAdsManager;
import com.google.android.gms.ads.AdListener;
import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.InterstitialAd;

import java.util.ArrayList;

/**
 * A simple {@link Fragment} subclass.
 */
public class LatestFunnyJokesFragment extends Fragment implements NativeAdsManager.Listener {


    final ArrayList<Joke> jokes = new ArrayList<>();
    private NativeAdsManager mNativeAdsManager;
    private RecyclerView listView;
    private InterstitialAd mInterstitialAd;

    public LatestFunnyJokesFragment() {
        // Required empty public constructor
    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        String placement_id = "1869998493118528_1870003033118074";
        mNativeAdsManager = new NativeAdsManager(getActivity(), placement_id, 0);
        mNativeAdsManager.loadAds();
        mNativeAdsManager.setListener(this);
        prepareAd();


        mInterstitialAd.setAdListener(new AdListener() {
            @Override
            public void onAdLoaded() {
                mInterstitialAd.show();
                super.onAdLoaded();

            }

            @Override
            public void onAdFailedToLoad(int i) {
                mInterstitialAd.loadAd(new AdRequest.Builder().build());

            }
        });


        View rootView = inflater.inflate(R.layout.joke_list, container, false );

        listView = rootView.findViewById(R.id.list);
        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        jokes.add(new Joke("1. एक खूबसूरत लड़की ने मुझसे रेस्टोरेन्ट में सवाल पूछा - \"आर यू सिंगल ?\" \n" +
                "\n" +
                "मैंने खुशी-खुशी रिप्लाय दिया  - \"जी हां...\" \n" +
                "\n" +
                "यह सुनते ही वो मेरे पास वाली Extra Chair लेकर चली गयी...."));
        jokes.add(new Joke("2. पत्नी - हर सफल आदमी के पीछे एक औरत होती है । \n" +
                "\n" +
                "पति - और अगर एक से ज्यादा औरते हुई तो ? खतरनाक जवाब... \n" +
                "\n" +
                "पत्नी - तो बाद में उस सफल एवं महान आदमी की कहानी \"सावधान इंडिया\" में दिखाते है ।"));
        jokes.add(new Joke("3. अमेरिकन - हमारे देश में सब लोग राईट साईड से गाड़ी चलाते है, तुम्हारे देश में क्या सिस्टम है ?\n" +
                "\n" +
                "भारतीय - ऐसा कुछ फिक्स नहीं है,\n" +
                "\n" +
                "मतलब, सामने वाला कौन-सी साइड से आरिया है, उस हिसाब से हम लोग एडजस्ट कर लेते है ।"));
        jokes.add(new Joke("4. अभी रास्ते में मुझे एक आदमी मिला और पूछा –\n" +
                "\n" +
                "ये डोसीमा का दवाखाना कहां है ?\n" +
                "\n" +
                "मैं भी सोच में पड़ गया कि, साला\n" +
                "\n" +
                "लेडिज का दवाखाना सुना है,\n" +
                "\n" +
                "बच्चों का दवाखाना भी सुना है ।\n" +
                "\n" +
                "पर ये डोसीमां का दवाखाना कहां होगा ?\n" +
                "\n" +
                "फिर बाद में उसने मुजे Address लिखी हुई पर्ची बताई तो उस पर लिखा हुआ था –\n" +
                "\n" +
                "“डॉ. सीमा का दवाखाना”\n" +
                "\n" +
                "है भगवान !!!!"));
        jokes.add(new Joke("5. पप्पू ने रेडियो स्टेशन पर कॉल किया और पूछा –\n" +
                "\n" +
                "“क्या आप 93.5 FM से बोल रहे है ?”\n" +
                "\n" +
                "FM वाला – जी हां…\n" +
                "\n" +
                "पप्पू – क्या मेरी आवाज सब सून रहे है ?\n" +
                "\n" +
                "FM वाला – जी हां, सून रहे है… आप लाईव है ।\n" +
                "\n" +
                "पप्पू – यानि घर में मेरी बहन , जो FM सुन रही है, उस तक बी मेरी आवाज पहुँच रही है !\n" +
                "\n" +
                "FM वाला – हां भाई हां…\n" +
                "\n" +
                "पप्पू – हेलो पिंकी… तेरा फोन स्विच ऑफ आ रहा है…\n" +
                "\n" +
                "अगर तू मेरी आवाज सुन रही है तो मोटर चालू कर दे,\n" +
                "\n" +
                "मैं उपर टोईलेट में बैठा हुँ,\n" +
                "\n" +
                "टंकी में पानी खत्म हो गया है…"));
        jokes.add(new Joke("6. साला एक सोलिड कंफ्यूजन है... \n" +
                "\n" +
                "दारू बनाने वाला कर्जे में है । \n" +
                "\n" +
                "दारू बनाने के लिये कर्ज देनेवाले कर्जे में है... और दारू पीने वाले भी कर्जे में है... \n" +
                "\n" +
                "तो साला पैसा गया कहा ???"));
        jokes.add(new Joke("7. जो अमृत पीते हैं उन्हें देव कहते है और जो विष पीते है, उन्हें महादेव कहते है... \n" +
                "\n" +
                "और जो रोजाना दोनो ही थोड़ा-थोड़ा करके पीते है उन्हें पतिदेव कहते है ।"));
        jokes.add(new Joke("8. पत्नी- अगर कुछ बोले तो, अपनी गर्दन को दो-बार उपर नीचे करें... \n" +
                "\n" +
                "ये योग सब योग का बाप है, ये योग आपके खुशहाल जिवन की कुंजी है... \n" +
                "\n" +
                "ध्यान रहे - गर्दन को कभी बाये-दाये न घुमाये, ये बहुत खतरनाक साबित हो सकता है...\n" +
                "\n" +
                " जनहित में जारी..."));
        jokes.add(new Joke("9. गर्भावस्था में अापकी पत्नी का यह खास ध्यान रखें... \n" +
                "\n" +
                "वो ज्यादा ट्रावेलिंग न करें... \"मोदी हो सकता है\" \n" +
                "\n" +
                "वो ज्यादा बेवकूफियां न करें... \"राहुल हो सकता है...\" \n" +
                "\n" +
                "और अगर उनको 1 हफ्ते से ज्यादा खाँसी रही तो सावधान... \"केजरीवाल भी हो सकता है...\" \n" +
                "\n" +
                "लक्षण दिखने पर डॉक्टर की सलाह ले... \n" +
                "\n" +
                "जनहित में जारी..."));
        jokes.add(new Joke("10. सवाल - आप चाय पीने के लिये किस हद तक जा सकते है ?\n" +
                "\n" +
                ". . . . जवाब - जी, मैं एक बार तो लड़की तक देखने चला गया था..."));
        jokes.add(new Joke("11. अच्छे और बहुत अच्छे टीचर में अंतर-\n" +
                "\n" +
                "अच्छा टीचर वो है जो परीक्षा में आपको “कड़ी मेहनत” करने की सलाह दे…\n" +
                "\n" +
                "और बहुत अच्छा टीचर वो है, जो आपको परीक्षा के वक्त कहे –\n" +
                "\n" +
                "“पर्चियाँ चबा जाओ, चेकिंग वाले आ गये है…”\n" +
                "\n" +
                "पिक्चर अभी बाकी है मेरे दोस्त…\n" +
                "\n" +
                "जब सबने पर्चियाँ चबा ली तो\n" +
                "वो टीचर सीट पर हँसते हुए जा बैठे और बोले –\n" +
                "\n" +
                "“कोई चेकिंग वाले नहीं आये…\n" +
                "अब लिखो पेपर…”"));
        jokes.add(new Joke("12. \"साँस रोकरकर तुझे छूने की कवायद, \n" +
                "\n" +
                "और हल्का-सा छूकर खुशी-खुशी लौट आना, \n" +
                "\n" +
                "जैसे जीत लिया हो, सारा जहाँ...\" . . . ये कोई रोमांटिक ❤️ शायरी नहीं है, \n" +
                "\n" +
                "कबड़्डी की परिभाषा है, फिर से पढ़ो, समझ जाओगे मोहब्बत के मरीजों..."));
        jokes.add(new Joke("13. बीवी - कल जो भिखारी आया था, वो बहुत कमीना था । \n" +
                "\n" +
                "पति - क्या हुआ ? \n" +
                "\n" +
                "बीवी - कल मैंने उसे खाना दिया था और आज वो मुझे एक किताब देकर गया है । \n" +
                "\n" +
                "पति - कौन-सी किताब ? \n" +
                "\n" +
                "बीवी - \"खाना पकाना सीखे...\""));
        jokes.add(new Joke("14. बीवी - मेरे पुराने कपड़े डोनेट करूँ क्या ? \n" +
                "\n" +
                "पति - फेंक दे, क्या डोनेट करना... \n" +
                "\n" +
                "बीवी - नहीं जी, दुनिया में बहुत-सी गरीब, भूखी-प्यासी औरते है, बिचारी कोई भी पहन लेगी...\n" +
                "\n" +
                "पति - तेरे नाप के कपड़े जिसको आ जाये, वो भूखी-प्यासी थोड़ी न होगी...\n" +
                "\n" +
                "अब पति घर से फरार है..."));
        jokes.add(new Joke("15. अपने बिस्तर पर छिपकली दिखना, कोई बड़ी समस्या नहीं है गालिब... \n" +
                "\n" +
                "बड़ी समस्या तो तब प्रारंभ होती है...\n" +
                "\n" +
                "जब वो गायब हो जाये, \n" +
                "\n" +
                "और कहीं भी दिखे नहीं... \"साली गयी कहाँ ?\""));
        jokes.add(new Joke("16. आज में 90,000 रू. लेकर iPhone लेने को मोबाईल शोप पर पहुँच ही गया... \n" +
                "\n" +
                "उतने में आवाज आयी - \"अब तो उठ जा नालायक, सुबह के 10 बज रहे है\" \n" +
                "\n" +
                "मेरे घरवाले तो मुझे सपने में भी iPhone नहीं लेने देते..."));
        jokes.add(new Joke("17. एक बाद समझ नहीं आ रही कि,\n" +
                "\n" +
                "– सरस्वती पूजा हम करते है, लेकिन होशियार बच्चे जापान \uD83C\uDDEF\uD83C\uDDF5 में पैदा होते है…\n" +
                "\n" +
                "– लक्ष्मी पूजा हम लोग करते है, लेकिन ज्यादा अमीर अमेरिका \uD83C\uDDFA\uD83C\uDDF8 में है….\n" +
                "\n" +
                "– विश्वकर्मा पूजा भी हम लोग करते है, लेकिन तकनीक चीन \uD83C\uDDE8\uD83C\uDDF3 के पास है…\n" +
                "\n" +
                "बहुत गड़बड़ है…\n" +
                "\n" +
                "ये देवी-देवता चढ़ावा तो हम से लेते है,\n" +
                "\n" +
                "लेकिन फल किसी और को दे रहे है…"));
        jokes.add(new Joke("18. इतना रोया था वो लड़का अपनी महेबूब को iPhone गिफ्ट कर के कि पूछो मत... \n" +
                "\n" +
                "जब रात 3 बजे तक वो सुनता रहा - \n" +
                "\n" +
                "\"आपके द्वारा डायल किया गया नंबर अभी व्यस्त है, कृपया कुछ देर बाद प्रयत्न करें\""));
        jokes.add(new Joke("19. जबसे पाकिस्तान \uD83C\uDDF5\uD83C\uDDF0 को पता चला है कि, \n" +
                "\n" +
                "उसके बजट के बराबर तो भारत \uD83C\uDDEE\uD83C\uDDF3 में कोई भी पैसा लेकर विदेश भाग जाते है, \n" +
                "\n" +
                "तब से उसकी हवा निकल गयी है... \n" +
                "\n" +
                "चार दिन से बॉर्डर शांत है, एक भी गोली नहीं चली है..."));
        jokes.add(new Joke("20. रामकथा चल रही थी कि, अचानक माईक पर एनाउंसमेन्ट हुआ –\n" +
                "\n" +
                "“हेलो, जेठालाल जी जहां कहीं भी हो,\n" +
                "\n" +
                "तुरंत घर पहुँचे, दया भाभी उनका घर पर इंतजार कर रही है ।”\n" +
                "\n" +
                "रामकथा सुन रहे जेठालाल तुरंत खड़े हुए और घर जाने लगे ।\n" +
                "\n" +
                "उतने में महिलाओं में बैठी दया भाभी चिल्लाई –\n" +
                "\n" +
                "“अरे ! बेठो-बेठो, राम कथा सुनो…\n" +
                "\n" +
                "मैंने तो सिर्फ चेक करने के लिये एनाउंसमेन्ट करवाया था कि,\n" +
                "\n" +
                "राम कथा ही सुनने गये हो, या कहीं ओर…”"));
        jokes.add(new Joke("21. आज का महाज्ञान प्यार में धोका खाने के बाद या फिर Breakup होने के बाद... \n" +
                "\n" +
                "अपने हाथ की नस काटने के बजाये,\n" +
                "\n" +
                "उसके घर की बिजली \n" +
                "\n" +
                "या केबल सप्लाई काट कर देखिये... \n" +
                "\n" +
                "बहोत अच्छा लगेगा..."));
        jokes.add(new Joke("22. इस दुनिया में दिमाग ही सिर्फ एक ऐसी चीज है - \n" +
                "\n" +
                "जिसे खाया, चाटा, गर्म, ठंडा और खराब किया जा सकता है ।\n" +
                "\n" +
                "यहीं नहीं... इसमें गोबर एवं भूसा भी भरा जा सकता है ।"));
        jokes.add(new Joke("23. व्हॉट्सऐप पर सेटींग अगर किसी को व्हॉट्सऐप पर सेटींग करनी हो तो आप... \n" +
                "\n" +
                "उपर राईट कोर्नर पर तीन डॉट पर टेप करें, \n" +
                "\n" +
                "वहाँ सेटींग का ओपशन है... \n" +
                "\n" +
                "इसप्रकार आप व्हॉट्सऐप पर सेटींग कर सकते है... \n" +
                "\n" +
                "आप भी न क्या-क्या सोचते रहते है..."));
        jokes.add(new Joke("24. टीचर सभी बच्चों को पढ़ा रही थी कि, \n" +
                "\n" +
                "\"दिल्ली में कुतुब मिनार है\" \n" +
                "\n" +
                "उस समय पप्पू क्लास में सो रहा था... \n" +
                "\n" +
                "टीचर उसके पास गई और उसका कान पकड़ कर पूछी - \"बोल तो, मैंने अभी क्या कहा था ?\" \n" +
                "\n" +
                "पप्पू - \"दिल्ली में कुत्ता बिमार है...\""));
        jokes.add(new Joke("25. पप्पू - डॉक्टर साहब, दस्त ने मेरा बेहाल कर रखा है... \n" +
                "\n" +
                "डॉक्टर - Hmm... वैसे कितना पतला आ रहा है ? \n" +
                "\n" +
                "पप्पू - डॉक्टर साहब... समझ लो कि, आप उससे कुल्ला कर सकते हो..."));
        jokes.add(new Joke("26. शब्दों का कमाल तो देखों गालिब \n" +
                "\n" +
                "जब अमिताभ बच्चन कहते है - \"देवियों और सज्जनों\" \n" +
                "\n" +
                "तो करोडपति बनने कि उमंग जगती है... \n" +
                "\n" +
                "किंतु जब, मोदी जी कहते है - \"भाईयों और बहेनों\" \n" +
                "\n" +
                "तो करोड़पति भी थर-थर कांपने लगते है..."));
        jokes.add(new Joke("27. एक महाकंजूस अपने बेटे को पिट रहा था... \n" +
                "\n" +
                "पडोसी - क्यों पिट रहे हो, इस मासूम बच्चे को ? \n" +
                "\n" +
                "कंजूस - मासूम बच्चा ??? अरे ! एक नंबर का शरारती है ये... \n" +
                "\n" +
                "मैंने इसे कहा था कि 1-1 सीढ़ी छोड़-छोड़ कर चढ़ना, चप्पल कम घिसेगी... \n" +
                "\n" +
                "नालायक, 2-2 सीढ़ी छोड़ कर चढ़ा, पजामा फट गया..."));
        jokes.add(new Joke("28. Santa एक बड़ी कंपनी में इन्टरव्यू देने गया ।\n" +
                "\n" +
                "बॉस – Congratulation ! आपको सिलेक्ट कर लिया गया है,\n" +
                "\n" +
                "आपकी पहले साल सेलेरी 5 लाख / साल होगी,\n" +
                "\n" +
                "और दूसरे साल 10 लाख / साल कर दी जायेगी ।\n" +
                "\n" +
                "यह सुनकर Santa उठकर जाने लगा…\n" +
                "\n" +
                "बॉस – क्या हुआ ?\n" +
                "\n" +
                "Santa – तो मैं अगले साल ही आऊँगा…"));
        jokes.add(new Joke("29. डॉक्टर - आप ने बहोत ही देर कर दी,\n" +
                "\n" +
                "इसे आप 1 घंटे पहले लाते तो शायद बच जाता... \n" +
                "\n" +
                "पप्पू - अबे साले, 5 मिनिट पहले तो इसका एक्सीडेन्ट हुआ है, \n" +
                "\n" +
                "1 घंटे पहले क्या जबरदस्ती ठोक कर लाते ? भूतनी के..."));
        jokes.add(new Joke("30. कुछ लड़को का कोमनसेन्स भी न बिलकुल जीरो होता है... \n" +
                "\n" +
                "साले, जेन्ट्स टोईलेट में लिखकर आयेंगे - \"आई लव यू प्रिया\" \n" +
                "\n" +
                "अब बोलो, क्या कभी प्रिया वहाँ पढ़ने जायेंगी ?"));
        jokes.add(new Joke("31. लड़का - क्या कर रही हो ? \n" +
                "\n" +
                "लड़की - मेल निकाल रही हुँ... \n" +
                "\n" +
                "लड़का - कब से नहीं नहाई हो... \n" +
                "\n" +
                "लड़की - ई-मेल निकाल रही हुँ... गँवार कही के..."));
        jokes.add(new Joke("32. आज का महाज्ञान अगर #Block कर के भी गुस्सा शांत न हो तो \n" +
                "\n" +
                "एक बार #Unblock करें.. \n" +
                "\n" +
                "और फिर से #Block करें... \n" +
                "\n" +
                "एक बार और फिर #Unblock करें... \n" +
                "\n" +
                "और फिर से उसे #Block कर दे... \n" +
                "\n" +
                "बस यही चीजे 5-10 बार दोहरायें... \n" +
                "\n" +
                "कसम से... तड़पा-तड़पा कर मारने वाली फिलिंग्स आयेगी... \n" +
                "\n" +
                "#डिजिटल_दुश्मनी"));
        jokes.add(new Joke("33. साबुन की Advertise में एक छोटी बच्ची, \n" +
                "\n" +
                "किसी महिला को मम्मी कहकर बुलाती है... \n" +
                "\n" +
                "और सब अचम्भित हो जाते है.. \n" +
                "\n" +
                "मेरा मानना ये है कि, उसके बाप को क्यों नहीं दिखाते ? \n" +
                "\n" +
                "वो भी तो उसी साबुन से नहाता होगा न ! \n" +
                "\n" +
                "जागो ग्राहक जागो..."));
        jokes.add(new Joke("34. मेरे एक पड़ोशी है, जिनका नाम है \"भगवान\" और उनकी लड़की का नाम है भक्ति । \n" +
                "\n" +
                "मम्मी बोलती है कि, \"बेटा भगवान की भक्ति में मन लगाया कर\" \n" +
                "\n" +
                "अब मम्मी को कैसे समझाऊ की भक्ति में तो मन लगाता हुँ, \n" +
                "\n" +
                "पर भगवान नहीं मान रहे..."));
        jokes.add(new Joke("35. डॉक्टर (संता से) - आपकी एक किडनी फेल हो गयी है... \n" +
                "\n" +
                "संता बहुत रोया... \n" +
                "\n" +
                "ठूस ठूस के रोया... \n" +
                "\n" +
                "थोड़ी देर बाद आँसू पोंछते हुए बोला - कितने नंबर से?"));
        jokes.add(new Joke("36. टॉयलेट में बैठा लड़का अगर किसी लड़की से व्हॉट्सऐप या फेसबुक पर चेट कर रहा हो, \n" +
                "\n" +
                "तो टोईलेट आये या ना आये, वो फिर भी वहां बैठा रहेगा... \n" +
                "\n" +
                "और घंटों वहां बैठने के बावजूद, पेरों में झुनझुनी आने की बात तो दूर की रही.. \n" +
                "\n" +
                "वो तो लकवा मार जाने तक वहीं बैठा रहेगा...."));
        jokes.add(new Joke("37. संता बहुत देर से दुकान में मक्खी मारते बैठा था । \n" +
                "\n" +
                "उतने में एक Lady ग्राहक आयी और बोली - \"लिप्टोन दी चाह है...?\" \n" +
                "\n" +
                "संता - मैनु तो नहीं है, तेनु है तो आ... लिपट जा... "));
        jokes.add(new Joke("38. औरते बाईक पर बैठने के बाद पति के जांघ पर क्यों हाथ रखती है ? पता है ? . \n" +
                "\n" +
                "क्योंकि, पति के जेब की गुटखा, तंबाखु और चुने की डब्बी रास्ते में न गिर जायें... \n" +
                "\n" +
                "आखिर, प्यार तो प्यार होता है... "));
        jokes.add(new Joke("39. जिंदगी बहुत छोटी है, \n" +
                "\n" +
                "इसे किसी से नफरत करने या बदला लेने में बर्बाद ना करें... \n" +
                "\n" +
                "खुद की तरक्की में बितायें... \n" +
                "\n" +
                "क्योंकि आप इंसान है, पाकिस्तान नहीं.... \n" +
                "\n" +
                "शक्कर सेहत के लिये हानिकारक क्यों है पता है ? नहीं पता... \n" +
                "\n" +
                "अरे ! क्योंकि हिंदी में इसे चीनी कहते है, \n" +
                "\n" +
                "और इसकी चाशनी को पाक.... "));
        jokes.add(new Joke("40. तरस तो मुझे उन लड़को पर आता है, \n" +
                "\n" +
                "जिनकी राशि कन्या है, \n" +
                "\n" +
                "लेकिन कुंडली में कन्या नहीं...\n" +
                "\n" +
                "सींगलपन तो इतनी हद तक बढ़ गया है गालिब... \n" +
                "\n" +
                "शायद हम श्मशान भी खोले तो साला लड़किया मरना बंध कर दे... "));
        jokes.add(new Joke("41. मर्दों के उपवास के नियम किसी की झूठी सिगरेट न पीना... \n" +
                "\n" +
                "झूठी दारू न पीना... \n" +
                "\n" +
                "चखने में सिर्फ फल... \n" +
                "\n" +
                "और हां... \n" +
                "\n" +
                "ये पान मसाला और गुटखा, अन्न में नहीं आता... \n" +
                "\n" +
                "जय मातादी... "));
        jokes.add(new Joke("42. आज का महाज्ञान - जब तक जिंदगी है DP बदलते रहो \n" +
                "\n" +
                "बाद में तो एक ही Photo पे फूलहार के साथ टंगे रहना है ।\n" +
                "\n" +
                "हर DP में बदली बदली सी शक्ल लगती है, उसकी गालीब... \n" +
                "\n" +
                "साली लड़की ना हुई वो, \n" +
                "\n" +
                "जैसे हुई ईच्छाधारी नागिन वो... \n" +
                "\n" +
                "#Filter_Effect"));
        jokes.add(new Joke("43. लड़का – हेलो पम्मी डार्लिंग, क्या कर रही हो ?\n" +
                "\n" +
                "लड़की – कौन ?\n" +
                "\n" +
                "लड़का – अरे, मैं हुँ, तेरा जान, पम्मी डार्लिंग…\n" +
                "\n" +
                "लड़की – तू बंटी है न ?\n" +
                "\n" +
                "लड़का – हा…\n" +
                "\n" +
                "लड़की – तू बंशीलाल का बेटा और रामलाल का पोता है न ?\n" +
                "\n" +
                "लड़का – हां, पर तुम कौन बोल रही हो ?\n" +
                "\n" +
                "लड़की – हरामखौर मैं तेरी माँ बोल रही हुँ…\n" +
                "\n" +
                "तुने पम्मी को नहीं… मम्मी को फोन लगाया है…\n" +
                "\n" +
                "नालायाक, तू घर आ अब…"));
        jokes.add(new Joke("44. भिखारी - साहब, पहले तो आप 50 रूपये देते थे, \n" +
                "\n" +
                "अब सिर्फ 10 रूपये देते हो ? \n" +
                "\n" +
                "आदमी - पहले में सिंगल था, अब मेरी शादी हो गयी है... \n" +
                "\n" +
                "भिखारी - वाह वाह साहब, हमारे ही पैसों से बीवी के साथ ऐश कर रहे हो..."));
        jokes.add(new Joke("45. 5000 करोड़ का टर्नओवर करने वाले रामदेव बाबा से एक निवेदन है कि, \n" +
                "\n" +
                "वे पतंजलि गर्लफ्रेन्ड भी Launch कर दें... \n" +
                "\n" +
                "जो पिज्जा, बर्गर के बजाय आयुर्वेदिक चूरण खाती हो... - \n" +
                "\n" +
                "एक बेरोगार आशिक"));
        jokes.add(new Joke("46. फिल्म शोले में जया बच्चन पुरी फिल्म में लालटेन जलाती रहती है... \n" +
                "\n" +
                "क्योंकि गाँव में बिजली नहीं है... \n" +
                "\n" +
                "तो भाई, ये बताओं कि, \n" +
                "\n" +
                "वीरू जीस टंकी पर चढ़कर मरने गया था, \n" +
                "\n" +
                "क्या उस टंकी में पानी ठाकुर चढ़ाता था..."));
        jokes.add(new Joke("47.  शाम होते ही घर के बजाय बार या ठेके की तरफ आकर्षित होने के नियम को दारुत्वाकर्षण कहते है - न्युटन का भाई पियुटन \n" +
                "\n" +
                "मुझे शराब की बोटल का स्वभाव पसंद आता है, \n" +
                "\n" +
                "जो खुद खाली होकर दूसरों को फूल कर देती है \n" +
                "\n" +
                "इसी को कहते है \"निःस्वार्थ सेवा\""));
        jokes.add(new Joke("48. पप्पू को क्लास में खड़ा कर टीचर ने सवाल पूछा - चलो पप्पू \"हाथ कंगन को आरसी क्या\" \n" +
                "\n" +
                "इस कहावत का अर्थ बताओ... \n" +
                "\n" +
                "पप्पू - जो औरतें हाथ में कंगन पहन कर गाड़ी चलाती है, \n" +
                "\n" +
                "उनसे पुलिस आर.सी. नहीं मांगती... \n" +
                "\n" +
                "चपल आया 100 की रफतार से... "));
        jokes.add(new Joke("49.  मैंने एक नेता से पूछा - सर जी, ये \"जनता\" और \"आदमी\" से पहले \"आम\" शब्द क्यों लगाते हैं ? \n" +
                "\n" +
                "जैसे कि, आम आदमी, आम जनता ? \n" +
                "\n" +
                "नेता जी बहुत ही खूबसूरत जवाब देते हुए बोले - ताकि उसे चूसा जा सके... \n" +
                "\n" +
                "और काम निकल जाने पर गुठली की तरह फेंका जा सकें.... "));
        jokes.add(new Joke("50. नौकरी भी पत्नी जैसी होती है । - जो एक बार मिलने के बाद छोड़ नहीं सकते. \n" +
                "\n" +
                "एक होते हुए दुसरी भी नहीं कर सकते... \n" +
                "\n" +
                "और एक खास बात - उसे छोड़कर बाकी सभी की अच्छी लगती है... "));

        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);

        JokeAdapter adapter = new JokeAdapter(getActivity(), jokes);

        listView.setAdapter(adapter);

        return rootView;
    }
    public void prepareAd(){
        mInterstitialAd = new InterstitialAd(getActivity());
        mInterstitialAd.setAdUnitId("ca-app-pub-2178015702183927/1772107559");
        mInterstitialAd.loadAd(new AdRequest.Builder().build());
    }
    @Override
    public void onAdsLoaded() {
        if (getActivity() == null) {
            return;
        }

        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        NativeAdRecyclerAdapter adapter =
                new NativeAdRecyclerAdapter(getActivity(), jokes, mNativeAdsManager);
        listView.setAdapter(adapter);
    }

    @Override
    public void onAdError(AdError error) {}


}