package com.nakulbhoria.funnyhindijokes;


import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.DividerItemDecoration;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.facebook.ads.AdError;
import com.facebook.ads.NativeAdsManager;

import java.util.ArrayList;

/**
 * A simple {@link Fragment} subclass.
 */
public class PositiveQuotesFragment extends Fragment implements NativeAdsManager.Listener {


    final ArrayList<Joke> jokes = new ArrayList<>();
    private NativeAdsManager mNativeAdsManager;
    private RecyclerView listView;

    public PositiveQuotesFragment() {
        // Required empty public constructor
    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        String placement_id = "1869998493118528_1870003033118074";
        mNativeAdsManager = new NativeAdsManager(getActivity(), placement_id, 0);
        mNativeAdsManager.loadAds();
        mNativeAdsManager.setListener(this);

        View rootView = inflater.inflate(R.layout.joke_list,container, false );

        listView = rootView.findViewById(R.id.list);
        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        jokes.add(new Joke("1. \uD83D\uDC90\uD83C\uDF39\uD83D\uDE4F\uD83D\uDE4F\uD83D\uDE4F\uD83C\uDF39\uD83D\uDC90\n" +
                "*कौन कहता है ?*\n" +
                "*आंसुओं में वजन नहीं होता,*\n" +
                "*एक आंसू भी छलक जाता है*\n" +
                "*तो मन हल्का हो जाता है..!!*\n" +
                "*जिन्दगीं में किसी का साथ काफी है,*\n" +
                "*कंधे  पर  किसी का  हाथ  काफी है,*\n" +
                "*दूर हो या पास...क्या फर्क पड़ता है,*\n" +
                "*अनमोल रिश्तों का तो*\n" +
                "*बस \"एहसास\" ही काफी है !!*\uD83D\uDC90\uD83C\uDF39\uD83D\uDE4F\uD83D\uDE4F\uD83D\uDE4F\uD83C\uDF39\uD83D\uDC90\n" +
                "\uD83C\uDF3A\uD83C\uDF3A सुप्रभात  \uD83C\uDF3A\uD83C\uDF3A\n" +
                "\uD83D\uDC90\uD83C\uDF39आपका दिन मंगलमय हो।\uD83C\uDF39\uD83D\uDC90 "));
        jokes.add(new Joke("2. *क्रोध और आंधी दोनों बराबर होते है.!*\n" +
                "\n" +
                "*शांत होने के बाद ही पता चलता है की कितना नुकसान हुआ है.!*\n" +
                "\n" +
                "*इसलिए हमेशा मुस्कुराते रहिये*\n" +
                "\n" +
                "*अच्छी सोच, अच्छी भावना,*\n" +
                "\n" +
                "*अच्छा विचार मन को हल्का करता है।*\n" +
                "......\uD83C\uDF37\uD83C\uDF1E *Good Morning* \uD83C\uDF1E\uD83C\uDF37"));
        jokes.add(new Joke("3.  \uD83C\uDF41✍\n" +
                "   *\"रिश्ता\" हवा की तरह होना चहिये, जो खामोश हो मगर सदैव आस पास हो।\uD83C\uDF39*\n" +
                "        \uD83D\uDCA7 *शुभ प्रभात* \uD83D\uDCA7"));
        jokes.add(new Joke("4.  \uD83C\uDF39\uD83D\uDE4F\uD83C\uDFFB\uD83D\uDE4F\uD83C\uDFFB✍✍✍\uD83D\uDE4F\uD83C\uDFFB\uD83D\uDE4F\uD83C\uDFFB\uD83C\uDF39\n" +
                "\n" +
                "*इंसान' की सोच भी 'अज़ीब' है 'कामयाबी' मिले तो अपनी 'अक्ल' पर खुश होता है...*\n" +
                "\n" +
                "*और जब 'मुसीबत' आये तो अपने 'नसीब' को दोष देता है...*"));
        jokes.add(new Joke("5.  *जब दर्द और कड़वी बोली*\n" +
                "           *दोनों सहन होने लगे*\n" +
                "*तो समझ लेना की..*\n" +
                "                   *जीना आ गया ।।*\n" +
                "\n" +
                "*प्रतिभा ईश्वर से मिलती है,*\n" +
                "*नतमस्तक रहें..!*\n" +
                "*ख्याति समाज से मिलती है,*\n" +
                "*आभारी रहें..!*\n" +
                "*लेकिन,,,*\n" +
                "*मनोवृत्ति और घमंड स्वयं से मिलते हैं,*\n" +
                "*सावधान रहें..!!*"));
        jokes.add(new Joke("6. *✍..कौन कहता है ?*\n" +
                "*आंसुओं में वजन नहीं होता,*\n" +
                "*एक आंसू भी छलक जाता है*\n" +
                "*तो मन हल्का हो जाता है..!!*\n" +
                "*जिन्दगीं में किसी का साथ काफी है,*\n" +
                "*कंधे  पर  किसी का  हाथ  काफी है,*\n" +
                "*दूर हो या पास...क्या फर्क पड़ता है,*\n" +
                "*अनमोल रिश्तों का तो*\n" +
                "*बस \"एहसास\" ही काफी है।*"));
        jokes.add(new Joke("7. *\uD83C\uDF39\"रिश्ता\"बारिश जैसा नहीं होना चाहिए, जो बरसकर खत्म हो जाय।*\n" +
                "                   *बल्कि*\n" +
                "   *\"रिश्ता\" हवा की तरह होना चहिये, जो खामोश हो मगर सदैव आस पास हो।\uD83C\uDF39*\n" +
                "        \uD83D\uDE4F\uD83D\uDE4Fसुप्रभात\uD83D\uDE4F\uD83D\uDE4F"));
        jokes.add(new Joke("8. ❤ *कौन  किसी  से  क्या  लेता  है,* \n" +
                "*कौन  किसी  को  क्या  देता   है*..\n" +
                "\n" +
                "\uD83C\uDF39 *थोडा  सा  हँस  लेते  है* ,\n" +
                "*थोडा  सा  हँसा  देते  है*\n" +
                "*दोस्ती  मे  यही  तो  होता है*  \uD83C\uDF39\n" +
                "\uD83D\uDE04     *हँसना और हँसाना कोशिश*\n" +
                "                      *है मेरी* ,\n" +
                "          *हर कोई खुश रहे, यह चाहत*\n" +
                "                      *है मेरी* ,\n" +
                "           *भले ही मुझे कोई याद करे*\n" +
                "                    *या ना करे* ,\n" +
                "             *लेकिन हर अपने को याद*\n" +
                "                   *करना  आदत है  मेरी*\n" +
                "             \uD83D\uDE4F\uD83C\uDFFB \uD83C\uDF3A\uD83C\uDF3A\uD83D\uDE4F\uD83C\uDFFB"));
        jokes.add(new Joke("9. *खुद की समझदारी भी* \n" +
                "*अहमियत रखती है,*\n" +
                "*वरना अर्जुन* \n" +
                "*और* \n" +
                "*दुर्योधन के गुरु तो* \n" +
                "*एक ही थे।*"));
        jokes.add(new Joke("10. \uD83C\uDF39\uD83D\uDE4F\n" +
                "✍ \" *बुराई वो ही करते है* \n" +
                "\n" +
                "*जो बराबरी नहीं कर सकते \"* \n" +
                "\n" +
                "*बस एक तज़ुर्बा लिया है ज़िन्दगी* *से..* \n" +
                "*अपनो के नज़दीक रहना है तो* *खामोश रहो* \n" +
                "       *ओर अपनो को नज़दीक* *रखना है तो* \n" +
                "*कोई भी बात दिल पर मत लो** \n" +
                "\n" +
                "*\uD83C\uDF39\uD83D\uDE4Fजय श्री राधे कृष्णा \uD83D\uDE4F\uD83C\uDF39*"));
        jokes.add(new Joke("11. *याददाश्त का कमज़ोर होना बुरी बात नहीं है जनाब,* \n" +
                "\n" +
                "\n" +
                "*बड़े बेचैन रहते है वो लोग जिन्हे हर बात याद रहती है....*"));
        jokes.add(new Joke("12.  *लफ़्ज़ों के बोझ से थक जाती हैं...*\n" +
                "*ज़ुबान कभी कभी...*\n" +
                "\n" +
                "*पता नहीं खामोशी......*\n" +
                "*मज़बूरी हैं.. या समझदारी..*"));
        jokes.add(new Joke("13.  *उनके कर्जदार और वफादार रहिये*\n" +
                "*जो आपके लिए अपना वक्त देते हैं!*\n" +
                "\n" +
                "                     *क्योकि*\n" +
                "\n" +
                "          *\"अंजाम की ख़बर तो*\n" +
                "            *कर्ण को भी थी. . .*\n" +
                "\n" +
                "*पर बात दोस्ती निभाने की थी।\"*"));
        jokes.add(new Joke("14. \u202A*_\uD83D\uDC90\uD83C\uDF39\uD83D\uDE4F\uD83C\uDF39\uD83D\uDC90_*\n" +
                "\n" +
                "*_✍\uD83C\uDFFBनींद और निंदा पर जो विजय पा लेते हैं, उन्हें आगे बढ़ने से कोई नहीं रोक सकता।_*\n" +
                "*_☝\uD83C\uDFFBऔर…_*\n" +
                "*_जो चीज आप को, “CHALLENGE” करती है, वही आपको “CHANGE” कर सकती है।_*\n" +
                "*_सदा मुस्कुराते रहिये_*\n" +
                "         “\uD83D\uDC1A☀\uD83D\uDC1A”"));
        jokes.add(new Joke("15.  \uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\n" +
                "             *किस्मत करवाती है*\n" +
                "         *कटपुतली का खेल जनाब!*\n" +
                "                          *वरना,*\n" +
                "\n" +
                "          *ज़िन्दगी के रंगमंच पर कोई भी*\n" +
                "          *कलाकार कमज़ोर नहीं होता!!*\n" +
                "\n" +
                "          *मिट्टी के दीपक सा*\n" +
                "                 *है ये जीवन..*\n" +
                "\n" +
                "                *तेल खत्म*\n" +
                "               *खेल खत्म...*.\n" +
                "\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F"));
        jokes.add(new Joke("16. *_खूबसूरत पंक्तियाँ_*\n" +
                "\n" +
                "\n" +
                "*मँज़िले बड़ी ज़िद्दी होती हैँ , हासिल कहाँ नसीब से होती हैं !*\n" +
                "\n" +
                "*मगर वहाँ तूफान भी हार जाते हैं , जहाँ कश्तियाँ ज़िद पर होती हैँ !*\n" +
                "\n" +
                "*भरोसा ” ईश्वर ” पर है, तो जो लिखा है तकदीर में, वो ही पाओगे !*\n" +
                "\n" +
                "*मगर , भरोसा अगर ” खुद ” पर है ,तो ईश्वर वही लिखेगा , जो आप चाहोगे !!!*"));
        jokes.add(new Joke("17.  *\"चरण उनके पूजे जाते है.* \n" +
                "*जिनके आचरण पूजने योग्य हो\"*  \n" +
                "\n" +
                "       *\"अगर इन्सान की पहचान करनी हो तो*\n" +
                "           *सूरत से नही. चरित्र से करो....\"*\n" +
                "                    *\"क्यूंकि सोना*\n" +
                "        *अक्सर लोहे की तिजोरी में*\n" +
                "            *ही रखा जाता है..........!!!*\n" +
                "         \uD83C\uDF3F\uD83C\uDF37\uD83C\uDF3A\uD83D\uDC90\uD83C\uDF3F\uD83C\uDF3B\uD83C\uDF39\uD83C\uDF3C\uD83C\uDF3F\n" +
                "*संबंध कभी भी मीठी आवाज़ या सुन्दर चेहरे से नहीं टिकते,*\n" +
                "*वो टिकते हैं सुन्दर ह्रदय और कभी ना टूटने वाले  विश्वास से..!*\n" +
                "\uD83C\uDF3F\uD83C\uDF3C\uD83C\uDF39\uD83C\uDF3B\uD83C\uDF3F\uD83D\uDC90\uD83C\uDF3A\uD83C\uDF37\uD83C\uDF3F\n" +
                "*रिश्तें वो नहीं जिसमे रोज बात हो,*\n" +
                "*रिश्तें वो भी नहीं जिसमे रोज साथ हो,*\n" +
                "*रिश्तें तो वो है जिसमे कितनी भी दूरियाँ हो,*\n" +
                "*लेकिन दिल में हंमेशा अपनो की याद हो.*\n" +
                "\uD83C\uDF3F\uD83C\uDF37\uD83C\uDF3A\uD83D\uDC90\uD83C\uDF3F\uD83C\uDF3B\uD83C\uDF39\uD83C\uDF3C\uD83C\uDF3F"));
        jokes.add(new Joke("18. *ज़िंदगी तो सभी के लिए* \n" +
                "    *एक रंगीन किताब है ..!*\n" +
                "            *फर्क बस इतना है कि,*\n" +
                "            *कोई हर पन्ने को दिल से*\n" +
                "           *पढ़ रहा है; और*\n" +
                "            *कोई दिल रखने के लिए*\n" +
                "            *पन्ने पलट रहा है।*\n" +
                "    *हर पल में प्यार है*\n" +
                "    *हर लम्हे में ख़ुशी है ..!*\n" +
                "           *खो दो तो यादें हैं,* \n" +
                "           *जी लो तो ज़िंदगी है* ..!!"));
        jokes.add(new Joke("19.  \uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\uD83C\uDF3F\n" +
                "\n" +
                "*मैंने बहुत से \"इन्सान\" देखे हैं, जिनके बदन पर \"लिबास\" नहीं होता।*\n" +
                "\n" +
                "*और बहुत से \"लिबास\" देखे हैं, जिनके अन्दर \"इन्सान\" नहीं होता।*\n" +
                "\n" +
                "*कोई \"हालात\" को नहीं समझता, तो कोई \"जज़्बात\" को नहीं समझता।*\n" +
                "\n" +
                "*ये तो बस अपनी-अपनी \"समझ\" है......*\n" +
                "\n" +
                "*कोई \"कोरा कागज़\" भी पढ़ लेता है, तो कोई पूरी \"किताब\" नहीं समझता।* "));
        jokes.add(new Joke("20.  *खुशियाँ कम और अरमान बहुत हैं ।*\n" +
                "*जिसे भी देखो परेशान बहुत है ।।*\n" +
                "\n" +
                "*करीब से देखा तो निकला रेत का घर ।*\n" +
                "*मगर दूर से इसकी शान बहुत है ।।*\n" +
                "\n" +
                "*कहते हैं सच का कोई मुकाबला नहीं ।*\n" +
                "*मगर आज झूठ की पहचान बहुत है ।।*\n" +
                "\n" +
                "*मुश्किल से मिलता है शहर में आदमी ।*\n" +
                "*यूं तो कहने को इन्सान बहुत हैं ।।*\n" +
                "\uD83D\uDC4C\uD83D\uDC4D\uD83C\uDF39\uD83D\uDE0A"));
        jokes.add(new Joke("21. *\uD83C\uDF43\"सफलता\" की पोशाक*\n" +
                "       *कभी तैयार नहीं मिलती*\n" +
                "      *इसे बनाने के लिए*\n" +
                "     *\"मेहनत\" का हुनर चाहिए.!*\n" +
                "\n" +
                "*✍\uD83C\uDFFB\"अच्छे\" और \"सच्चे\" रिश्ते*\n" +
                "            *न तो \"खरीदे\" जा सकते हैं,*\n" +
                "        *न ही \"उधार\" लिऐ जा सकते हैं*\n" +
                "\n" +
                "                     *_इसलिए_*\n" +
                "\n" +
                "        *उन लोगों को जरूर \"महत्व\" दें*\n" +
                "         *जो \"आपको\" महत्व देते हैं...*"));
        jokes.add(new Joke("22. \uD83C\uDF3F \uD83C\uDF3A\uD83D\uDC49सुंदर सुबह का \uD83D\uDC48\uD83C\uDF3A\uD83C\uDF3F \n" +
                "                     मीठा  मीठा \n" +
                "    \uD83C\uDF3F\uD83C\uDF3A\uD83D\uDC49नमस्कार..\uD83D\uDC48\uD83C\uDF3A\uD83C\uDF3F\n" +
                "\n" +
                "              ना घुमने के लिये कार चाहिए ,\n" +
                "              ना गले के लिए हार चाहिए ,\n" +
                "\n" +
                "           \" भगवद् गीता मे श्री कृष्णा ने बहुत बड़ी बात कही है \" !!!\n" +
                "\n" +
                "             जीवन के उद्धार के लिए केवल मित्र , प्रेम और परिवार चाहिए..... \uD83D\uDE0A    "));
        jokes.add(new Joke("23. माली *प्रतिदिन* पौधों में पानी \n" +
                "                     देता हॆ।\n" +
                "              मगर फल\uD83C\uDF50सिर्फ\n" +
                "         *मौसम* में ही आता हॆ।\n" +
                "      इसीलिये जीवन में *धॆर्य* रखें\n" +
                "     प्रत्येक चीज अपने *समय* पर \n" +
                "                      होगी\n" +
                "       प्रतिदिन *बेहतर* काम करें\n" +
                "       समय पर फल जरुर मिलेगा"));
        jokes.add(new Joke("24. *नेक लोगों की संगत से*\n" +
                "    *हमेशा भलाई ही मिलती हे,*\n" +
                "                  *क्योंकि....*\n" +
                "   *हवा जब फूलो से गुज़रती हे,*\n" +
                "*तो वो भी खुश्बुदार हो जाती हे.*"));
        jokes.add(new Joke("25. *\uD83D\uDC93दिल \uD83D\uDC93ने कहा की*\n" +
                "      *कोई याद कर रहा है*\n" +
                "*मैने सोचा \uD83D\uDC9Eदिल\uD83D\uDC93*\n" +
                "       *मजाक कर रहा है*\n" +
                "*फिर जब आई हिचकी* \n" +
                "       *तो ख्याल आया*\n" +
                "*की कोई अपना ही* \n" +
                "       *मेसेज का इंतजार* \n" +
                "*कर रहा है ।।*"));
        jokes.add(new Joke("26. *भरोसा खुद पर रखो*\n" +
                "                 *तो ताकत बन जाती है*\n" +
                "*और दूसरों पर रखो तो*\n" +
                "                 *कमजोरी बन जाती है…!*\n" +
                "*आप कब सही थे...*\n" +
                "                *इसे कोई याद नहीं रखता।*\n" +
                "*लेकिन आप कब गलत थे...*\n" +
                "                *इसे सब याद रखते हैं।*\n" +
                "\n" +
                "*पृथ्वी पर कोई भी व्यक्ति ऐसा नहीं है\"*\n" +
                "   *\"जिसको समस्या न हो\"*\n" +
                "           *\"और\"*\n" +
                "*\"पृथ्वी पर कोई समस्या ऐसी नहीं है\"*\n" +
                "*\"जिसका कोई समाधान न हो...*\n" +
                "\n" +
                "*मंजिल  चाहें  कितनी भी  ऊँची  क्यों न हो,  रास्ते  हमेशा  पैरों  के  नीचे  ही  होते है।*"));
        jokes.add(new Joke("27.  *वृक्ष के नीचे पानी डालने से सबसे ऊंचे पत्ते पर भी पानी पहुँच जाता है ,*\n" +
                "\n" +
                "*उसी प्रकार प्रेम पूर्वक किये गए कर्म परमात्मा तक पहुंच जाते हैं*।\n" +
                "\n" +
                "*सेवा सभी की करिये मगर,आशा किसी से भी ना रखिये*\n" +
                "\n" +
                "*क्योंकि सेवा का सही मूल्य भगवान् ही दे सकते हैं इंसान नहीl*.”॥*"));
        jokes.add(new Joke("28.  \uD83D\uDE4F\uD83C\uDFFB *इन्सान को कभी अपने वक़्त*  \n" +
                "   *पर घमन्ड नही करना चाहिए*\n" +
                "             *क्योंकि*\n" +
                "*वक़्त तो उन नोटों का भी*         \n" +
                "        *नहीं हुआ* \n" +
                "*जो कभी पूरा बाजार खरीदने*   \n" +
                "      *की ताकत रखते थे*\n" +
                "\n" +
                "\uD83D\uDE4Fसुभप्रभात\uD83D\uDE4F"));
        jokes.add(new Joke("29.  *अक्सर लोग कहते हैं की*\n" +
                "*पैसा सम्भाल कर रखो*\n" +
                "*बुरे वक्त पर काम आयेगा*\n" +
                "\n" +
                "*पर अक्सर लोग*\n" +
                "*यह भूल जाते है कि*\n" +
                "\n" +
                "*\"रिश्ते सम्भाल कर रखे तो,*\n" +
                "*बुरा वक्त यूं ही गुजर जायेगा...!\"*"));
        jokes.add(new Joke("30.  *श्रीकृष्ण कहते हैं :- इस संसार में हर किसी को अपने \"ज्ञान\" का \"घमंड\" हैं।*\n" +
                "*परन्तु*\n" +
                "*किसी को भी अपने \"घमंड\" का \"ज्ञान\" नहीं हैं।*"));
        jokes.add(new Joke("31.  जो *पिता* के पैरों को छूता है\n" +
                "           वो कभी *गरीब* नहीं होता।\n" +
                "\n" +
                "जो *मां* के पैरों को छूता है \n" +
                "         वो कभी *बदनसीब* नही होता।\n" +
                "\n" +
                "जो *भाई* के पैरा को छूता है \n" +
                "         वो कभी *गमगीन* नही होता।\n" +
                "\n" +
                "जो *बहन* के पैरों को छूता है \n" +
                "       वो कभी *चरित्रहीन* नहीं होता। \n" +
                "\n" +
                "*जो गुरू के पैरों को छूता है*\n" +
                "         *उस जैसा कोई*\n" +
                "                *खुशनसीब नहीं होता*.......\n" +
                "\n" +
                "\uD83D\uDC9Eअच्छा *दिखने* के लिये मत जिओ \n" +
                "          बल्कि *अच्छा* बनने के लिए जिओ\uD83D\uDC9E\n" +
                "\n" +
                "\uD83D\uDC9Eजो *झुक* सकता है वह सारी \n" +
                "          ☄दुनिया को *झुका* सकता है \uD83D\uDC9E\n" +
                "\n" +
                "\n" +
                "\uD83D\uDC9E अगर बुरी आदत *समय पर न बदली* जाये \n" +
                "          तो बुरी आदत *समय बदल देती* है\uD83D\uDC9E\n" +
                "\n" +
                "\n" +
                "  \uD83D\uDC9Eचलते रहने से ही *सफलता* है,\n" +
                "          रुका हुआ तो पानी भी *बेकार* हो जाता है \uD83D\uDC9E\n" +
                "\n" +
                "\uD83D\uDC9E *झूठे दिलासे* से *स्पष्ट इंकार* बेहतर है\n" +
                "   अच्छी *सोच*, अच्छी *भावना*,\n" +
                "          अच्छा *विचार* मन को हल्का करता है\uD83D\uDC9E\n" +
                "\n" +
                "\uD83D\uDC9Eमुसीबत सब पर आती है,\n" +
                "          कोई *बिखर* जाता है \n" +
                "            और कोई *निखर* जाता है\uD83D\uDC9E\n" +
                "\uD83D\uDC9Eदुनिया की ताकतवर चीज है *\"लोहा\"*\uD83D\uDD29\n" +
                "       जो सबको काट डालता है ....\n" +
                "लोहे से ताकतवर है *\"आग\"*\uD83D\uDD25\n" +
                "        \uD83D\uDC9Eजो लोहे को पिघला देती है....\uD83D\uDC9E\n" +
                "\uD83D\uDC9Eआग से ताकतवर है *\"पानी\"*\uD83C\uDF27\n" +
                "        ☄जो आग को बुझा देता है.... \uD83D\uDC9E\n" +
                "\uD83D\uDC9Eऔर पानी से ताकतवर है *\"इंसान\"*\n" +
                "        जो उसे पी जाता है....\uD83D\uDC9E\n" +
                "\uD83D\uDC9Eइंसान से भी ताकतवर है *\"मौत\"*\n" +
                "         जो उसे खा जाती है....\uD83D\uDC9E\n" +
                "\uD83D\uDC9Eऔर मौत से भी ताकतवर है *\"दुआ\"* \n" +
                "      जो मौत को भी टाल सकती है...\uD83D\uDC9E\n" +
                "\n" +
                "\uD83D\uDC9E \"तेरा मेरा\"करते एक दिन चले जाना है...\n" +
                "         जो भी कमाया यही रह जाना है\uD83D\uDC9E\n" +
                "      *\uD83D\uDC9Eकर ले कुछ अच्छे कर्म\uD83D\uDC9E*\n" +
                "      *\uD83D\uDC9Eसाथ यही तेरे आना है\uD83D\uDC9E*\n" +
                "\n" +
                "        *\uD83D\uDC9Eमुझे वो \uD83D\uDC4C\uD83C\uDFFCरिश्ते पसंद है,*\n" +
                "    *जिनमें \"मैं\" नहीं \"हम\"हो\uD83D\uDC9E*✍\uD83C\uDFFB\n" +
                "\n" +
                "\uD83D\uDC9E\uD83D\uDC9E\uD83D\uDC9E\uD83D\uDC9E\uD83D\uDC9E\uD83D\uDC9E\uD83D\uDC9E\n" +
                "\uD83D\uDCB2Happy World Family Day\uD83D\uDCB2\n" +
                "\n" +
                "         \"परिवार\" से बड़ा कोई\n" +
                "            \"धन\" नहीं!\n" +
                "            \"पिता\" से बड़ा कोई \n" +
                "            \"सलाहकार\" नहीं!\n" +
                "            \"माँ\" की छाव से बड़ी\n" +
                "             कोई \"दुनिया\" नहीं!\n" +
                "            \"भाई\" से अच्छा कोई  \n" +
                "            \"भागीदार\" नहीं!\n" +
                "            \"बहन\" से बड़ा कोई\n" +
                "            \"शुभचिंतक\" नहीं!\n" +
                "            \"पत्नी\" से बड़ा कोई\n" +
                "            \"दोस्त\" नहीं\n" +
                "                    इसलिए\n" +
                "            \"परिवार\" के बिना\n" +
                "            \"जीवन\" नहीं!!!\n" +
                "           \uD83D\uDC4F\uD83C\uDFFB\uD83D\uDC4F\uD83C\uDFFB\uD83D\uDC4F\uD83C\uDFFB\uD83D\uDC4F\uD83C\uDFFB\uD83D\uDC4F\uD83C\uDFFB"));
        jokes.add(new Joke("32.  *रोज़ याद न कर पाऊँ तो* \n" +
                "*खुदग़रज़ ना समझ लेना*...\n" +
                "\n" +
                "*दरअसल छोटी सी जिन्दगी है*\n" +
                "*और परेशानियां बहुत हैं*...\n" +
                "\n" +
                "*मैं भूला नहीं हूँ किसी को*\n" +
                "*मेरे बहुत अच्छे दोस्त है* *ज़माने में*...\n" +
                "\n" +
                "*बस जिंदगी उलझी पड़ी है*\n" +
                "*दो वक़्त की रोटी कमाने में*..."));
        jokes.add(new Joke("33.  *कदर करना सिख लो..*\n" +
                "*ना जिंदगी वापस आती है...*\n" +
                "  *ना जिंदगी में आये हुये लोग....*\n" +
                "\n" +
                "*कई बार तबियत दवा लेने से नहीं*,\n" +
                "*हाल पूछने से भी ठीक हो जाती है* "));
        jokes.add(new Joke("34. *\uD83C\uDF39\uD83C\uDF39सादर नमस्कार \uD83C\uDF39\uD83C\uDF39*\n" +
                "\n" +
                "*खूबसूरत है वो हाथ....*\n" +
                "*जो मुश्किल के वक़्त....*\n" +
                "*किसी का सहारा बन जाये...*\n" +
                "\n" +
                "*खूबसूरत है वो जज्बात.....*\n" +
                "*जो दूसरों की भावनाओं....*\n" +
                "*को समझ जाये...*\n" +
                "\n" +
                "*खूबसूरत है वो आँखे...*\n" +
                "*जिनमे किसी के खूबसूरत...*\n" +
                "*ख्वाब समां जाये...*\n" +
                "\n" +
                "*खूबसूरत है वो दिल....*\n" +
                "*जो किसी के दुःख में....*\n" +
                "*शामिल हो जाये...*"));
        jokes.add(new Joke("35.  *अगर लोग सिर्फ जरूरत पर ही*      \n" +
                "           *आपको याद करते हैं,*\n" +
                "       *तो उन्हें गलत मत समझिये,*\n" +
                "                     *क्योंकि* \n" +
                "      *आप उनकी जिन्दगी की वो*     \n" +
                "            *रोशनी की किरण हैं*\n" +
                "                 *जो उन्हें सिर्फ,*\n" +
                "      *अन्धेरों में ही दिखाई देती है…।*"));
        jokes.add(new Joke("36. *कमरा कितनी भी साफ हो*\n" +
                "*\"धूल\" तो हो ही जाती है,*\n" +
                "\n" +
                "*इंसान कितना भी अच्छा हो*\n" +
                "*\"भूल\" तो हो ही जाती*\n" +
                "\n" +
                "*\"मैं अपनी  'ज़िंदगी' मे हर किसी   को 'अहमियत' देता हूँ...*\n" +
                "*क्योंकि जो 'अच्छे' होंगे वो 'साथ' देंगे...*\n" +
                "*और जो 'बुरे' होंगे वो 'सबक' देंगे...!!*\n" +
                "\n" +
                "*जिंदगी जीने के लिए सबक*\n" +
                "*और साथ दोनों जरुरी होता है।*"));
        jokes.add(new Joke("37. *किसी भी मोड़ पर अगर*\n" +
                "               *मै बुरा  लगूं....*\n" +
                "\n" +
                "*तो ज़माने को बताने से पहले*\n" +
                "*एक बार मुझे जरूर बता देना ,*\n" +
                "\n" +
                "*क्योंकि बदलना मुझे है ,*  *ज़माने को नहीं .* "));
        jokes.add(new Joke("38. *शानदार  रिश्ते चाहिए तो  उन्हें गहराई से निभाइये..*\n" +
                "\n" +
                "*\"लाजवाब मोती\" कभी किनारों पे नही मिलते..*"));
        jokes.add(new Joke("39. *\uD83C\uDF31मन की लिखूँ तो शब्द रूठ जाते हैं...*\n" +
                "\n" +
                "*और सच लिखूँ तो अपने रूठ जाते हैं...*\n" +
                "\n" +
                "*\"जिन्दंगी को समझना बहुत मुशकिल हैं जनाब,,*\n" +
                "*कोई सपनों की खातिर \"अपनों\" से दूर रहता हैं*\n" +
                "*और कोई \"अपनों\" के खातिर सपनों से दूर\"...!*☺\uD83D\uDE4F\uD83C\uDFFB"));
        jokes.add(new Joke("40.  *एक  अजीब  सी  दौड़  है*\n" +
                "                     *ये  जिन्दगी.*\n" +
                "        *जीत  जाओ तो  कई  अपने*\n" +
                "               *पीछे  छूट  जाते  हैं*\n" +
                "             *और  हार  जाओ  तो,*\n" +
                "      *अपने  ही  पीछे  छोड़  जाते  हैं*"));
        jokes.add(new Joke("41.          *हमेशा खुश*\n" +
                "                *रहना  चाहिए,* \n" +
                "                   *क्योंकि*\n" +
                "               *परेशान होने से*\n" +
                "              *कल की मुश्किल*\n" +
                "                *दूर नही होती*\n" +
                "                   *बल्कि....*\n" +
                "              *आज का सुकून*\n" +
                "               *भी चला जाता*\n" +
                "                     *है !!*"));
        jokes.add(new Joke("42. *जो दूसरों को इज़्ज़त देता है*\n" +
                "*असल में वो खुद इज़्ज़तदार होता है*\n" +
                "             *क्योकि*\n" +
                "*इंसान दूसरो को वही दे पाता है*\n" +
                "  *जो उसके पास होता है।*\n" +
                "\n" +
                "\n" +
                "*घमंड से अपना सर ऊँचा न करें*\n" +
                "\n" +
                "*जीतने वाले भी अपना गोल्ड मैडल सिर झुका के हासिल करते हैं...*"));
        jokes.add(new Joke("43. ✍ _*नाराज न होना कभी,\n" +
                "        यह सोचकर कि… \n" +
                "             काम मेरा\n" +
                "               और\n" +
                "         नाम किसी का\n" +
                "           हो रहा है..\n" +
                "\n" +
                "       घी और रुई सदियों से,\n" +
                "       जलते चले आ रहे हैं…,\n" +
                "                *और* \n" +
                "          लोग कहते हैं…,\n" +
                "        *दिया जल रहा है।*\n" +
                "          *सुप्रभात*\n" +
                "   *जय श्री राम*   "));


        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        JokeAdapter adapter = new JokeAdapter(getActivity(), jokes);

        listView.setAdapter(adapter);

        return rootView;

    }
    @Override
    public void onAdsLoaded() {
        if (getActivity() == null) {
            return;
        }

        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        NativeAdRecyclerAdapter adapter =
                new NativeAdRecyclerAdapter(getActivity(), jokes, mNativeAdsManager);
        listView.setAdapter(adapter);
    }

    @Override
    public void onAdError(AdError error) {}


}