package com.nakulbhoria.funnyhindijokes;


import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.DividerItemDecoration;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.facebook.ads.AdError;
import com.facebook.ads.NativeAdsManager;
import com.google.android.gms.ads.AdListener;
import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.InterstitialAd;

import java.util.ArrayList;

/**
 * A simple {@link Fragment} subclass.
 */
public class TeacherStudentJokesFragment extends Fragment implements NativeAdsManager.Listener {

    final ArrayList<Joke> jokes = new ArrayList<>();
    private NativeAdsManager mNativeAdsManager;
    private RecyclerView listView;
    private InterstitialAd mInterstitialAd;

    public TeacherStudentJokesFragment() {
        // Required empty public constructor
    }


    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {

        String placement_id = "1869998493118528_1870003033118074";
        mNativeAdsManager = new NativeAdsManager(getActivity(), placement_id, 0);
        mNativeAdsManager.loadAds();
        mNativeAdsManager.setListener(this);

        prepareAd();


        mInterstitialAd.setAdListener(new AdListener() {
            @Override
            public void onAdLoaded() {
                mInterstitialAd.show();
                super.onAdLoaded();

            }

            @Override
            public void onAdFailedToLoad(int i) {
                mInterstitialAd.loadAd(new AdRequest.Builder().build());

            }
        });

        View rootView = inflater.inflate(R.layout.joke_list, container, false );

        listView = rootView.findViewById(R.id.list);
        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        jokes.add(new Joke("1. टीचर:\n" +
                "बहुवचन किसे कहते है?\n" +
                "\n" +
                "पप्पू:\n" +
                "जब बहू अपने ससुराल वालो को खरी-खोटी सुनाती है\n" +
                "तो उसे बहु वचन कहते है।\n" +
                "\n" +
                "अध्यापक जी बेहोश होते होते बचे।"));
        jokes.add(new Joke("2. हद तो तब,\n" +
                "सभी पार हो गई….\n" +
                "\n" +
                "जब एक लड़का,\n" +
                "क्लास में,\n" +
                "मैडम से…..\n" +
                "\n" +
                "May I Go To Toilet…..\n" +
                "\n" +
                "बोलकर…..\n" +
                "मूवी देखने चला गया….!!"));
        jokes.add(new Joke("3. अध्यापक:\n" +
                "“संतोष आम खाता हैं”\n" +
                "इस वाक्य को अंग्रेजी में ट्रांसलेट करो?\n" +
                "\n" +
                "पप्पू ने अंग्रेज़ी में ट्रांसलेट किया:\n" +
                "“Satisfaction is General Account”!!"));
        jokes.add(new Joke("4. शिक्षक: MATHS का फुल फॉर्म बताओ..??\n" +
                "\n" +
                "छात्र: मेरी आत्मा तुझे हमेशा सताएगी..!\n" +
                "\n" +
                "टीचर आज तक सोच रहा है…कि लड़के ने फूल फॉर्म बताया था कि बददुआ दी थी."));
        jokes.add(new Joke("5. मैडम, बच्चे से::\n" +
                "तेरी कॉपी और पेन कहाँ है????\n" +
                "\n" +
                "बच्चा-\n" +
                "मेम जबसे आपको देखा\n" +
                "क्या कॉपी और क्या पेन,\n" +
                "तेरे मस्त-मस्त दो नैन,\n" +
                "मेरे दिल का ले गये चैन,\n" +
                "खो गई कॉपी, गुम गया पेन."));
        jokes.add(new Joke("6. मास्टर – कल स्कुल क्यूँ नहीं आये?\n" +
                "बबलू – गल्फ्रेंड से मिलने गया था .\n" +
                "\n" +
                "मास्टर – किस लिये ?\n" +
                "बबलू – येस सर.\n" +
                "\n" +
                "मास्टर – मैंने पूछा किस लिये?\n" +
                "बबलू – लिये सर बहुत लिये… "));
        jokes.add(new Joke("7. छात्र :-\n" +
                "सर राष्ट्र गान\n" +
                "और\n" +
                "राष्ट्र पशु\n" +
                "दोनों एक साथ आये तो\n" +
                "खड़ा रहना है या भागना है?\n" +
                "\n" +
                "सर ने इस्तीफा दे दिया!"));
        jokes.add(new Joke("8. टीचर : बच्चो, वादा करो कि कभी शराब, सिगरेट नहीं पिओगे।✊\n" +
                "\n" +
                "बच्चे : नहीं पीएंगे।\n" +
                "\n" +
                "टीचर : कभी लड़कियों का पीछा नहीं करोगे!\n" +
                "बच्चे : नहीं करेंगे।\n" +
                "\n" +
                "टीचर : लड़कियों से दोस्ती नहीं करोगे!\n" +
                "बच्चे : नहीं करेंगे।\n" +
                "\n" +
                "टीचर : वतन के लिए जान दे दोगे!\n" +
                "बच्चे : दे देंगे, ऐसी जिन्दगी का करेंगे भी क्या.."));
        jokes.add(new Joke("9. टीचरः\n" +
                "धोबी का कूत्ता ना घर का ना घाट का..\n" +
                "ऐसा ही ऐक और सेंटेंस बनाओ.\n" +
                "\n" +
                "पप्पू – सानिया मिर्जा का बच्चा ना भारत का ना पाकिस्तान का :\n" +
                "टीचर बेहोश !!!"));
        jokes.add(new Joke("10. जिंदगी की मुसीबतें उन स्टूडेंट्स का रास्ता कभी नहीं रोक सकतीं,\n" +
                "जो….\n" +
                "\n" +
                "बचपन में पेंसिल छोटी हो जाने पर\n" +
                "\n" +
                "उसके पीछे पेन का ढक्कन लगाकर,\n" +
                "उसे फिर से पकड़ने लायक बना लेते थे !"));
        jokes.add(new Joke("11. टीचर:-\n" +
                "“क्लास में लड़ाई\n" +
                "क्यों नही करनी चाहिए..?”\n" +
                "\n" +
                "पप्पू:-\n" +
                "“क्योंकि पता नही\n" +
                "एग्जाम में कब किसके पीछे\n" +
                "बैठना पड़ जाये..!”"));
        jokes.add(new Joke("12. टीचर: अगर अपना कैरेक्टर सुधारना चाहते हो\n" +
                "तो अपनी टीचर को मां समझो….\n" +
                "\n" +
                "संता: मैडम इससे तो हमारे पापा का कैरेक्टर खराब होगा….!!"));
        jokes.add(new Joke("13. अध्यापक –\n" +
                "टेबल पर चाय किसने गिराई? इसे अपनी मातृभाषा मे बोलो ।\n" +
                "\n" +
                "छात्र –\n" +
                "मातृभाषा मतलब मम्मी की भाषा में ?\n" +
                "\n" +
                "अध्यापक – हां ।\n" +
                "\n" +
                "छात्र – अरे छाती कूटा म्हारा जीव लियां बिना थने चैन नी पड़े ? ओ की थारो बाप ढोली चाय ?\n" +
                "\n" +
                "अध्यापक बेहोश !…"));
        jokes.add(new Joke("14. ग्रामर की टीचर पप्पू से –\n" +
                "“संदीप अब शराब नहीं पीता है।\n" +
                "“इसमें संदीप क्या है ??\n" +
                "\n" +
                ".\n" +
                "\n" +
                "पप्पू –\n" +
                "इसमें संदीप माता रानी का भगत है और\n" +
                "उसने नवरात्रा रखा हुआ है।"));
        jokes.add(new Joke("15. टीचर : 1869 में क्या हुआ ?\n" +
                "\n" +
                "सुरेश :- गांधीजी का जन्म!\n" +
                "\n" +
                "टीचर :- बिलकुल सही. बैठो निचे ..\n" +
                "\n" +
                "टीचर :- पप्पू तु बोल.. 1872 में क्या हुआ…?\n" +
                "\n" +
                "पप्पू :- गांधीजी ३ साल के हो गए… मैं भी बैठू क्या?"));
        jokes.add(new Joke("16. अध्यापक: अकबर कौन था?\n" +
                "पप्पू: अकबर Gay tha\n" +
                "\n" +
                "अध्यापक:- क्या? तुम पागल हो गए हो? बताओ ऐसा क्यों लगता है तुम्हे?\n" +
                "\n" +
                "पप्पू:-\n" +
                "हम सबने सुना है…\n" +
                "लैला – मजनू,\n" +
                "हीर – राँझा,\n" +
                "सोनी – महिवाल,\n" +
                "रोमियो – जूलिएट\n" +
                "\n" +
                "बस केवल…\n" +
                "अकबर – बीरबल !\n" +
                "\n" +
                "अध्यापक बेहोश!"));
        jokes.add(new Joke("17. कानपुरिया धमाका\n" +
                "\n" +
                "टीचर (लड़के से) : “काहे बे… कल स्कूल काहे नहीं आए…..??”\n" +
                "\n" +
                "लड़का : “काहे… कल जौ आये रहें… उनका कलेक्टर बना दिए हो का…??”"));
        jokes.add(new Joke("18. टीचर : “कौनसा पंछी सबसे तेज़ उड़ता है?\n" +
                "\n" +
                "स्टूडेट : “सर, हाथी।\n" +
                "\n" +
                "टीचर : “नालायक, तेरा बाप क्या करता है?\n" +
                "\n" +
                "स्टूडेट : “दाउद के गैंग में ‘शूटर है।\n" +
                "\n" +
                "टीचर : “शाबाश।\n" +
                "लिखो बच्चो ‘हाथी’।"));
        jokes.add(new Joke("\n" +
                "\n" +
                "19. अध्यापक: किसी ऐसी जगह का नाम बतायो जहां पर बहुत सारे लोग हों फिर भी तुम अकेला महसूस करो?\n" +
                "\n" +
                "छात्र: परीक्षा कक्ष!\n" +
                "\n" +
                "अध्यापक: बेहोश!"));
        jokes.add(new Joke("20. मास्टर जी एक होटल में ख़ाली कटोरी में रोटी डुबो-डुबो कर खा रहे थे।\n" +
                "\n" +
                "वेटर ने पूछा:\n" +
                "मास्टरजी ख़ाली कटोरी में कैसे खा रहे हैं?\n" +
                "\n" +
                "मास्टर जी:\n" +
                "भइया, हम गणित के अध्यापक हैं।\n" +
                "दाल हमने ‘मान ली’ है।"));
        jokes.add(new Joke("21. एक बार प्राइमरी स्कूल में मास्टर जी गहरी नींद मे सो रहे थे\n" +
                "\n" +
                "तभी कलेक्टर साहब आ गये\n" +
                "मास्टर जी पकडे गये\n" +
                "बहुत देर उठाने के बाद तब\n" +
                "मास्टर की नींद खुली और बोले\n" +
                "\n" +
                "बच्चों कुंभकर्ण ऐसे सोता है\n" +
                "इसे कहते है गतिविधि आधारित शिक्षण…!\n" +
                "\n" +
                "कलक्टर साहब सन्न….\n" +
                "\n" +
                "मास्टर से बचकर रहना रे …."));
        jokes.add(new Joke("22. एक क्लास में एक लड़की को सब बुआ-बुआ कहते थे…..✔\n" +
                "\n" +
                "एक दिन इस की शिकायत ऊसने अपने टीचर से कर दी……\n" +
                "\n" +
                "टीचर ने सब लडको से पूछा ….\n" +
                "\n" +
                "जो लड़के इस को बुआ कहते है वो सभी खडे हो जाए…….\n" +
                "\n" +
                "एक लड़के को छोड के सभी खडे हो गये…..\n" +
                "\n" +
                "टीचर ने पुछा……क्या तुम इस को बुआ नहीं कहते हो …\n" +
                "\n" +
                "लड़का बोला…… सर मु तो फूफाजी हूँ…….."));
        jokes.add(new Joke("23. क्या अजीब संयोग है..\n" +
                "स्कूल में हाजिरी लेते लेते अचानक कलम रुक गयी.\n" +
                "लड़की का नाम था “परिधि व्यास”\n" +
                "\n" +
                "मैने कहा:\n" +
                "क्या खूब “ज्यामितीय” नाम है !\n" +
                "बेटी… तुम्हारे पापा का नाम…..?\n" +
                "\n" +
                "वो बोली : जी….”आधार” चंद्र व्यास ।\n" +
                "\n" +
                "और मम्मी…..?\n" +
                "\n" +
                "वो बोली : जी…..”त्रिज्या” व्यास ।\n" +
                "\n" +
                "और भाई….?\n" +
                "वो बोली : जी “कर्ण” व्यास ।\n" +
                "\n" +
                "फिर तो परिवार में “रेखा” और “बिंदु” भी होंगी ?\n" +
                "\n" +
                "वो शरमाकर बोली, जी “दोनों” बुआजी हैं मेरी !!"));
        jokes.add(new Joke("24. शरारती बच्चा: मास्टरजी एक सवाल पूछें\n" +
                "\n" +
                "मास्टर जी: हाँ हाँ पूछो।\n" +
                "बच्चा: हाथी को फ्रीज में कैसे रखेंगे?\n" +
                "\n" +
                "मास्टरजी: बेवकूफ, हाथी फ्रीज में नहीं जा सकता है ।\n" +
                "बच्चा:\n" +
                "मास्टरजी फ्रीज बहुत बड़ा है,\n" +
                "पहले फ्रीज खोलेंगे और हाथी को अंदर डाल देंगे\n" +
                "\n" +
                "बच्चा: एक सवाल और पूछूँ ।\n" +
                "मास्टरजी: हाँ हाँ पूछो ?\n" +
                "बच्चा: गधे को फ्रीज में कैसे रखेंगे ?\n" +
                "मास्टरजी: पहले फ्रीज खोलेंगे और गधे को उस में रख देंगे ।\n" +
                "बच्चा:\n" +
                "गलत जवाब,\n" +
                "पहले हाथी को बाहर करेंगे\n" +
                "फिर गधे को फ्रीज में रखेंगे\n" +
                "\n" +
                "बच्चा: एक सवाल और पूछूँ?\n" +
                "मास्टरजी: हाँ हाँ पूछो ।\n" +
                "बच्चा:\n" +
                "बंदर के जन्मदिन की पार्टी में सभी जानवर एवं जीव-जन्तु आए\n" +
                "परन्तु एक जानवर नहीं आया ।\n" +
                "उसका नाम बतलायें ?\n" +
                "\n" +
                "मास्टरजी : शेर नहीं आया होगा क्योंकि वह आता तो सभी को खा जाता !\n" +
                "बच्चा :\n" +
                "फिर गलत जवाब,\n" +
                "गधा पार्टी में नहीं आया\n" +
                "क्योंकि गधे को तो हमने फ्रीज में बंद कर दिया था\n" +
                "\n" +
                "बच्चा: एक सवाल और पूछूँ ?\n" +
                "मास्टरजी: (गुस्से से) बोल हरामजादे ।\n" +
                "\n" +
                "बच्चा: रास्ते में एक नदी है\n" +
                "जिसमें एक खतरनाक मगरमच्छ रहता है एवं\n" +
                "उस नदी के ऊपर आने-जाने के लिए पुल भी नहीं है,\n" +
                "आप नदी कैसे पार करोगे ?\n" +
                "मास्टरजी: मैं नाव लेकर नदी पार करूंगा !\n" +
                "\n" +
                "बच्चा: फिर गलत जवाब ।\n" +
                "मास्टर: बोल, कैसे ?\n" +
                "बच्चा: मास्टरजी इतनी जल्दी नाव कहाँ से आपको मिलेगी,\n" +
                "तबतक तो आप नदी तैरकर भी पार कर लोगे ।\n" +
                "\n" +
                "मास्टर: मगरमच्छ से तेरा बाप बचाएगा ?\n" +
                "बच्चा:\n" +
                "मास्टरजी! आपकी इतनी फटती क्यों है?\n" +
                "आपको तो पता है कि सभी जीव-जानवर\n" +
                "बंदर की Birthday पार्टी में गए हुए हैं\n" +
                "तो मगरमच्छ नदी में कैसे आ जाएगा !!!\n" +
                "\n" +
                "मास्टरजी बेहोश हो गए!!!!"));
        jokes.add(new Joke("25. छात्र से टीचर ने पूछा बताओ एक साल में कितनी रात्रि होती हे..\n" +
                "\n" +
                "छात्र– 10 रात्रि\n" +
                "\n" +
                "टीचर — 10 कैसे\n" +
                "\n" +
                "छात्र- 9 नवरात्री ओर 1 शिवरात्रि.\n" +
                "\n" +
                "टीचर अभी तक कोमा में हे।"));
        jokes.add(new Joke("26. टीचर:\n" +
                "जिसको सुनाई नहीँ देता उसको क्या कहेँगे ?\n" +
                "\n" +
                "शिष्य:\n" +
                "कुछ भी कह दो साले को!\n" +
                "कौनसा सुनाई देता है!!"));
        jokes.add(new Joke("27. छुट्टी कै लाने आबेदन पत्र……\n" +
                "\n" +
                "सेवा मे..\n" +
                "श्रीमान मास्साब..\n" +
                "माध्मिक पाठशाला बुंदेलखंड\n" +
                "\n" +
                "माहानुभव,\n" +
                "तो मस्साब ऐसो है कि दो दिना से चड़ रओ है जो बुखार और उपर से जा नाक बह रई सो अलग || जई के मारे हम सकूल नई आ पाहे सो तमाए पाऊ पर के निवेदन आए कि दो-चार दिना की छुट्टी दे देते, तो बडो अछछो रहतो और अगर हम नई आये तो कोन सो तमाओ सकूल बंद हो जै |||||||\n" +
                "\n" +
                "तुमाओ\n" +
                "आग्याकारी शिष्य,\n" +
                "“कलुआ”"));
        jokes.add(new Joke("28. अच्छे और बहुत अच्छे टीचर में अंतर:\n" +
                "\n" +
                "अच्छा टीचर वो है जो परीक्षा में आपको कड़ी मेहनत की सलाह दे…\n" +
                "\n" +
                "और बहुत अच्छा टीचर वो है, जो आपको परीक्षा के वक़्त कहे..\n" +
                "“कंजरों, पर्चियां चाब जाओ, फ्लाइंग आ गयी”!"));
        jokes.add(new Joke("29. हिंदी का पीरियड था..\n" +
                "\n" +
                "मास्टर ने पूछा:\n" +
                "कविता और निबंध मैं क्या अंतर है\n" +
                "\n" +
                "स्टूडेंट:\n" +
                "प्रेमिका के मुंह से निकला एक शब्द भी कविता होता है\n" +
                "और\n" +
                "पत्नी का एक ही शब्द निबंध के समान होता है\n" +
                "\n" +
                "मास्टर के आंख मैं आंसू आ गए,\n" +
                "गला भर आया..\n" +
                "उन्होने उस लड़के को क्लास का मानीटर बनाया ।"));
        jokes.add(new Joke("30. टीचर छात्र से:\n" +
                "आयात और निर्यात का एक अच्छा सा उदाहरण बताओ.\n" +
                "\n" +
                "छात्र:\n" +
                "सोनिया गांधी और सानिया मिर्ज़ा..\n" +
                "\n" +
                "टीचर:\n" +
                "तुम्हारे चरण कहाँ हैं बेटा ।"));
        jokes.add(new Joke("31. गाँव के एक विद्यालय से….\n" +
                "\n" +
                "अध्यापक: 15th अगस्त को हमे क्या मिली थी ?\n" +
                "\n" +
                "छात्र: माड़साहब….”नुक्ति”\n" +
                "\n" +
                "……….\n" +
                "\n" +
                "अगर सही जवाब आपको भी नह पता,\n" +
                "तो मैं बताता हूँ!\n" +
                "\n" +
                "– आज़ादी"));
        jokes.add(new Joke("32. छात्र (भगवान से):\n" +
                "हज़ारो की किस्मत तेरे हाथ है,\n" +
                "अगर पास करदे तो क्या बात है!\n" +
                "\n" +
                "परीक्षा के बाद …\n" +
                "\n" +
                "भगवान:\n" +
                "गर्लफ्रेंड थोड़ी कम पटाता तो क्या बात थी,\n" +
                "किताबे तो सारी तेरे पास थी...."));
        jokes.add(new Joke("33. टीचर:- एक तरफ पैसा,\n" +
                "दुसरी तरफ अक्कल, क्या चुनोगे ?\n" +
                "\n" +
                "विद्यार्थीः पैसा.\n" +
                "\n" +
                "टीचर:- गलत, मै अक्कल चुनती\n" +
                "\n" +
                "विद्यार्थीः- आप सही कह रही हो मेडम,\n" +
                "जिसके पास जिस चीज की कमी होती है वो वही चुनता है ……………\n" +
                "\n" +
                "दे थप्पड़ दे थप्पड़ !!!!"));
        jokes.add(new Joke("34. अध्यापक: बताओ बच्चो हमारी पृथ्वी किसका चक्कर लगाती है?\n" +
                "\n" +
                "संता: – “सूर्य का”\n" +
                "\n" +
                "अध्यापक:\n" +
                "बहूत अच्छा बेटे,\n" +
                "और हमारी पृथ्वी का चक्कर कौन लगाता है?\n" +
                "\n" +
                "सारे विधार्थी एक साथ: नरेंद्र मोदी!!"));
        jokes.add(new Joke("35. टीचर: 1 से 10 तक गिनती सुनाओ।\n" +
                "\n" +
                "संता: 1, 2, 3, 4, 5, 7, 8, 9, 10..\n" +
                "\n" +
                "टीचर: 6 कहां है ?\n" +
                "\n" +
                "संता: जी वो तो मर गया।\n" +
                "\n" +
                "टीचर: मर गया? कैसे मर गया???\n" +
                "\n" +
                "संता: जी मैडम, आज सुबह टीवी पर न्यूज में बता रहे थे कि स्वाईन फ्रलू में 6 की मौत हो गई ! "));
        jokes.add(new Joke("36. पप्पू की हुई मास्टर से लड़ाई\n" +
                "मास्टर ने की पप्पू की पिटाई\n" +
                "\n" +
                "पप्पू का गरम हुआ खून..\n" +
                "\n" +
                "गया कब्रिस्तान और मास्टर की,\n" +
                "फोटो टांग के लिख दिया\n" +
                "COMING SOON!!"));
        jokes.add(new Joke("37. कल जो मैंने एक बच्चे से पूछा:\n" +
                "पढ़ाई कैसी चल रही है?\n" +
                "\n" +
                "उसका जवाब आया\n" +
                "अंकल,\n" +
                "\n" +
                "समंदर जितना सिलेबस है;\n" +
                "नदी जितना पढ़ पाते हैं;\n" +
                "बाल्टी जितना याद होता है;\n" +
                "गिलास भर लिख पाते हैं;\n" +
                "चुल्लू भर नंबर आते हैं;\n" +
                "उसी में डूब कर मर जाते हैं।"));
        jokes.add(new Joke("\n" +
                "38. पप्पू का बेटा,\n" +
                "ऐसी तस्वीर बनाता कि लगता मानो\n" +
                "तस्वीर जिन्दा है.!!\n" +
                "\n" +
                "मास्टर जी ने,\n" +
                "पप्पू को फोन किया – ..आपका बेटा\n" +
                "बड़ा शैतान है ..!!\n" +
                "\n" +
                "आज उसने क्लासरूम की\n" +
                "जमीन पे 1000 रूपये के नोट की हूबहू\n" +
                "फोटो बना दी..उसे उठाने के चक्कर में मेरे\n" +
                "नाख़ून टूट गए..इसे समझाते क्यों नहीं..?\n" +
                "\n" +
                "पप्पू – ..मास्टरजी ..मैं खुद ICU से\n" +
                "बोल रहा हूँ..पगले ने कल बिजली के\n" +
                "सॉकेट पे केटरीना बना दी थी..!!\n" +
                "\n" +
                "होंठ जल गए करेंट से.!!"));
        jokes.add(new Joke("39. अध्यापक: “भाईचारा” शब्द का प्रयोग करते हुए कोई वाक्य बनाओ।\n" +
                "\n" +
                "चिंटू :\n" +
                "मैंने दूध वाले से पूछा,\n" +
                "तुम दूध इतना महंगा क्यों बेचते हो\n" +
                "तो वह बोला भाई चारा महंगा हो गया है।\n" +
                "\n" +
                "दे थप्पड़ दे थप्पड़ … "));
        jokes.add(new Joke("40. Teacher: A B C सुनाओ..\n" +
                "\n" +
                "संता: A B C\n" +
                "\n" +
                "Teacher: और सुनाओ…\n" +
                "\n" +
                "संता: और सब बढियां, आप सुनाओ!"));
        jokes.add(new Joke("41. टीचर : मैं 2 वाक्य दूंगा आपको उसमें अंतर बताना है\n" +
                "1. उसने बर्तन धोये\n" +
                "2. उसे बर्तन धोने पड़े\n" +
                "संजू : पहले वाक्य में कर्ता अविवाहित है और दुसरे वाक्य में कर्ता विवाहित है। टीचर अभी तक बेहोश है।"));
        jokes.add(new Joke("42. रसायन शास्त्र की कक्षा में\n" +
                "\n" +
                "टीचर: पानी का फॉर्मूला बताओ\n" +
                "\n" +
                "स्टूडेंट: H2O + MgCl2 + CaSO4 + AlCl3 + NaOH + KOH + HNO3 +HCl + CO2 …\n" +
                "\n" +
                "टीचर: ये उत्तर गलत है .\n" +
                "\n" +
                "स्टूडेंट: मैडम, ये नाले का पानी है।"));
        jokes.add(new Joke("43. टीचर :- देश के सबसे ईमानदार पुलिसवाले कहा पर पाए जाते है…???\n" +
                "\n" +
                ".\n" +
                "\n" +
                "पप्पू :- सावधान इंडिया और क्राइम पेट्रोल !"));
        jokes.add(new Joke("44. टीचर : राजू तुम किस लिए कॉलेज आते हो.\n" +
                "छात्र : विद्या के लिए सर.\n" +
                "टीचर: तो आज तुम सो क्यों रहे हो.\n" +
                "छात्र: आज विद्या नहीं आई है सर."));
        jokes.add(new Joke("45. टीचर ने छात्रों से पुछा।\n" +
                "\n" +
                "टीचर: एक बात बताओ, तुम पढाई में ध्यान क्यों नहीं देते?\n" +
                "\n" +
                "एक छात्र: क्योंकि पढाई सिर्फ दो वजहों से की जाती है।\n" +
                "1st डर से\n" +
                "2nd शौख़ से\n" +
                "और,\n" +
                "फालतू के शौख हम रखते नहीं और\n" +
                "डरते तो किसी के बाप से नहीं।"));
        jokes.add(new Joke("46. टीचर – संजू यमुना नदी कहॉं बहती है ?\n" +
                "संजू – जमीन पर\n" +
                "टीचर – नक्शे में बताओं कहॉं बहती है ?\n" +
                "संजू – नक्शे में कैसे बह सकती है, नक्शा गल नहीं जाएगा!!!"));
        jokes.add(new Joke("47. टीचर : तुम परिंदो के बारे में सब जानते हो ??\n" +
                "संजू : हाँ\n" +
                "टीचर : अच्छा ये बताओ कौन सा परिंदा उड़ नहीं सकता ??\n" +
                "संजू : मरा हुआ परिंदा\n" +
                "भाग पागल कहीं का...."));
        jokes.add(new Joke("48. टीचर (स्टूडेंट से) : सेमेस्टर सिस्टम से क्या फायदा है, बताओ?\n" +
                "स्टूडेंट : फायदा तो पता नहीं, पर बेइज्जती साल में दो बार हो जाती है!!!!"));
        jokes.add(new Joke("49. टीचर : वाक्य को अंग्रेजी में ट्रांसलेट करो ‘वसंत ने मुझे मुक्का मारा’\n" +
                "संजू : वसन्तपंचमी !!!"));
        jokes.add(new Joke("50. टीचर: नालायक पढ़ ले कभी तुने अपनी कोई बुक खोल के देखी है?\uD83D\uDE12\n" +
                "संजू : हाँ मैं रोज़ खोलता हूँ एक बुक!\n" +
                "टीचर : कौन सी?\n" +
                "संजू : फेसबुक !!!"));

        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        JokeAdapter adapter = new JokeAdapter(getActivity(), jokes);

        listView.setAdapter(adapter);

        return rootView;
    }


    public void prepareAd(){
        mInterstitialAd = new InterstitialAd(getActivity());
        mInterstitialAd.setAdUnitId("ca-app-pub-2178015702183927/1772107559");
        mInterstitialAd.loadAd(new AdRequest.Builder().build());
    }

    @Override
    public void onAdsLoaded() {
        if (getActivity() == null) {
            return;
        }

        listView.setLayoutManager(new LinearLayoutManager(getActivity()));
        DividerItemDecoration itemDecoration =
                new DividerItemDecoration(getActivity(), DividerItemDecoration.VERTICAL);
        listView.addItemDecoration(itemDecoration);
        NativeAdRecyclerAdapter adapter =
                new NativeAdRecyclerAdapter(getActivity(), jokes, mNativeAdsManager);
        listView.setAdapter(adapter);
    }

    @Override
    public void onAdError(AdError error) {}


}